const app = document.querySelector("#app");
const form = document.querySelector("form");
const src_inp = form.querySelector("input[name=source]");
const tgt_inp = form.querySelector("input[name=target]");
const aligns_inp = form.querySelector("input[name=aligns]");

const src = app.querySelector("#source");
const tgt = app.querySelector("#target");
const alignsEl = app.querySelector("#alignments");

const error = document.querySelector("#error");


//==============================================================================

banglaTexts = [
    'এতে কুটনৈতিক ভুল বোঝাবুঝির কারণে বিরক্ত মুসোলিনি ২৮শে অক্টবর ১৯৪০ আলবেনিয়া থেকে গ্রিস আক্রমণ করলেন',
    '৬ই এপ্রিল একই দিনে আকাশ থেকে বোমাবর্ষণ এবং বুলগেরিয়া ও অস্ট্রিয়া দিয়ে সৈন্য পাঠিয়ে জার্মানী গ্রিস ও যুগোস্লাভিয়া আক্রমণ করল ',
    'মহা বিস্ফোরণ তত্ত্ব অনুসারে মহাবিশ্ব একটি অতি ঘন বিন্দুবৎ অবস্থা থেকে উৎপত্তি লাভ করেছে',
    'এর মাধ্যমেই মহাবিশ্বের প্রাচীনতম বস্তুসমূহের গঠন সম্পর্কে ব্যাখ্যা পাওয়া যায় যার জন্য মহা বিস্ফোরণ মতবাদের পরই আলফারবেটেগ্যামফ তত্ত্ব প্রণীত হয়েছে',
    'আইনস্টাইন সাধারণ আপেক্ষিকতার জন্য এই ক্ষেত্র সমীকরণগুলোর গোড়াপত্তন করেছিলেন',
    'দুইটি স্বতন্ত্র সম্ভাবনা রয়েছে',
    'হয়েল এবং ল্যমেত্র্\u200c কর্তৃক প্রস্তাবিত এই দুটি নকশা ছাড়াও মহাবিশ্বের উৎপত্তি নিয়ে বেশ কিছু নকশা প্রস্তাব করা হয়',
    'বর্তমানে মানুষের রয়েছে কোবে হাবল স্পেস টেলিস্কোপ এবং ডব্লিউম্যাপ র মত উচ্চ ক্ষমতার দুরবিন',
    'মহাবিশ্ব সৃষ্টির ১০−৪৩ সেকেন্ড পর পদার্থবিজ্ঞানের সূত্রগুলো কার্যকারিতা লাভ করে',
    'অর্থাৎ প্রতিকোয়ার্ক এবং প্রতিলেপ্টনের চেয়ে কোয়ার্ক এবং লেপ্টনের পরিমাণ সামান্য বৃদ্ধি পায়',
    'এরই সাথে অবশিষ্ট প্রোটন এবং প্রতিপ্রোটনের মধ্যে শুরু হয় ভরের পূর্ণবিলয় annihilation',
    'মহা বিস্ফোরণের প্রায় ৩৮০০০০ বছর পর ইলেকট্রন এবং নিউক্লিয়াস একত্রিত হয়ে পরমাণু তৈরি করে এর মধ্যে মূলত হাইড্রোজেন পরমাণু সৃষ্টি হয়',
    'ডব্লিউএমএপি নামক কৃত্রিম উপগ্রহ থেকে পাওয়া সবচেয়ে নির্ভরযোগ্য তথ্যের ভিত্তিতে জানা গেছে যে মহাবিশ্বে শীতল অদৃশ্য বস্তুর পরিমাণ সবচেয়ে বেশী প্রায় শতকরা ৮০ ভাগ',
    'বলতে গেলে এই শক্তির অবস্থার সমীকরণ এবং কণা পদার্থবিজ্ঞানের আদর্শ নকশার সাথে এর সম্পর্ক বিষয়ে তাত্ত্বিক ও ব্যবহারিক উভয় ক্ষেত্রে অনেক পর্যবেক্ষণ ও গবেষণা এখনও বাকি রয়ে গেছে',
    'এই বিষয়টি বোঝার জন্য যুগোপযোগী তত্ত্ব প্রণয়নই বর্তমানে পদার্থবিজ্ঞানের বৃহত্তম সমাধানহীন সমস্যা',
    'যেকোন দুটি বিন্দুর কমোভিং দূরত্ব তথা স্থানাংক দূরত্ব একই থাকলেও এই কমোভিং বিন্দুসমূহের ভৌত দূরত্ব মহাবিশ্বের স্কেল উৎপাদকের সাথে সমানুপাতিক হারে বৃদ্ধি পায়',
    'অর্থাৎ আমরা অতীত মহাবিশ্বের সমগ্র অংশ কখনই দেখতে পারবোনা',
    'এগুলো হল ছায়াপথসমূহের লাল অপসারণ দেখে গৃহীত হাবলধরণের সম্প্রসারণ মহাজাগতিক ক্ষুদ্রতরঙ্গ পটভূমির বিস্তৃত পরিমাপ এবং আলোক উপাদানসমূহের প্রাচুর্য',
    'এই পর্যবেক্ষণটিই এখন পর্যন্ত মহা বিস্ফোরণ তত্ত্বের মৌলিক ভিত্তিভূমি হিসেবে স্বীকৃত',
    'এই বিন্দুতে কেন্দ্রীন ও ইলেকট্রন একত্রিত হয়ে পরমাণু তৈরি করে',
    'এই আবিষ্কার মহা বিস্ফোরণ মতবাদের পক্ষে একটি যুক্তেই হয়ে দাঁড়ায় এবং পেনজিয়াস ও উইলসনকে এনে দেয় নোবেল পুরস্কার',
    'এই মৌলগুলোর প্রাচুর্য মূলত ফোটন এবং বেরিয়নের অনুপাতের উপর নির্ভর করে',
    'আশ্চর্যজনকভাবে দেখা যায় নবীন মহাবিশ্বে ডিউটেরিয়াম অপেক্ষা হিলিয়ামের পরিমাণ বেশী অথবা হিলিয়মের ৩He চেয়ে ডিউটেরিয়াম বেশী এবং এরা সর্বদা ধ্রুব অনুপাত বজায় রাখে',
    'বর্তমানে প্রায় সকল গবেষক মহা বিস্ফোরণ তত্ত্বকে মেনে নিলেও এক সময় এমনটি ছিলনা',
    'এগুলো সমাধানের জন্য প্রয়োজন মহা বিস্ফোরণ কেন্দ্রীন সংশ্লেষ বিষয়ে স্বাধীন গবেষণা মহাজাগতিক ক্ষুদ্র তরঙ্গ পটভূমি বিকিরণের মূল বিষয় নিয়ে অধ্যয়ন এবং মহাবিশ্বের বৃহৎ পরিসর গঠনে বিদ্যমান অতি নব তারা নিয়ে অধ্যয়ন',
    'সমতা সমস্যা',
    'কিন্তু বর্তমান পর্যবেক্ষণ প্রমাণ করেছে যে পর্যবেক্ষণযোগ্য মহাবিশ্ব প্রায়ো পুরোটাই পদার্থ দ্বারা গঠিত',
    'মহাবিশ্বে তারার মোট সংখ্যার মধ্যে যে পরিমাণ বর্তুলাকার স্তবক রয়েছে সেগুলোর কম্পিউটার সিমুলেশনের মাধ্যমে জানা যায় তারা প্রায় ১৫ বিলিয়ন বছর পূর্বে গঠিত হয়েছে',
    'এর পর বিজ্ঞানীরা এই ধারণা গ্রহণ করতে বাধ্য হন যে মহাবিশ্বের শতকরা প্রায় ৯০ ভাগ পদার্থই সাধারণ বেরিয়ন পদার্থ নয় বরং এরা হচ্ছে অদৃশ্য বস্তু dark matter',
    'কারণ এর মহাকর্ষীয় প্রভাব সঠিকভাবে বোঝা যায় না',
    'এ থেকেই এসেছে অদৃশ্য শক্তির ধারণা',
    'অন্যদিকে এই ঘনত্ব যদি ক্রান্তি ঘনত্বের সমান বা কম হয় তবে একসময় সম্প্রসারণ ধীর হয়ে যাবে কিন্তু কখনই শেষ হবে না',
    'এই তত্ত্বে বলা হয়েছে মহাবিশ্বের কেবল মহাকর্ষীয়ভাবে সীমাবদ্ধ বস্তুগুলোই একসাথে থাকবে যেমন ছায়াপথ অবশ্য মহাবিশ্বের প্রসারণ ও শীতলায়নের ফলে এদেরও তাপীয় মৃত্যু ঘটবে',
    'স্ফীতির ক্ষেত্রে আমরা অবশ্যই ধরে নেই যে সূচকীয় সম্প্রসারণ মহাকাশের বৃহৎ অঞ্চলকে আমাদের পর্যবেক্ষণযোগ্য দিগন্তের বাইরে ঠেলে দিয়েছে',
    'তবে এর মূল নীতিগুলো এখন পর্যন্ত সুস্পষ্টভাবে প্রমাণিত নয়',
    'মহা বিস্ফোরণ তত্ত্ব সম্পর্কে বিভিন্ন ধর্মের ব্যাখ্যার একটি তালিকা এখানে দেয়া হয়েছে',
    'এ বিষয়ে উল্লেখযোগ্য আয়াতটি হচ্ছে সূরা আম্বিয়া ২১ ৩০',
    'জনপ্রিয় জেন সংস্কৃতিতে কম্পনশীল মহাবিশ্ব তত্ত্ব সমর্থিত হয়',
    'ছায়াপথ শ্রেণী ও স্তবকগুলোর সাথে সিএমবির মিথস্ক্রিয়ার দিকে লক্ষ্য করার মাধ্যমে এই পরিমাপ করা হচ্ছে',
    'যেখানে',
    'এজন্যই বলা হয় স্ফীতিশীলতা তত্ত্ব স্বীকার করে নিলে মহাবিশ্বকে প্রায় সম্পূর্ণ সমতল ধরতে হয়',
    'গবেষণা সহযোগী নিবন্ধসমূহ',
    'গণিতে জটিল সংখ্যা ইংরেজি ভাষায় Complex numberকে বাস্তব সংখ্যার একটি গাণিতিক সম্প্রসারণ হিসেবে গণ্য করা হয়',
    'ইতালীয় গণিতিবিদ জিরোলামো কার্দানো ত্রিঘাত সমীকরণ সমাধান করতে গিয়ে প্রথম জটিল সংখ্যা আবিষ্কার করেন',
    'যেমন জটিল বিশ্লেষণ জটিল মেট্রিক্স জটিল বহুপদী এবং জটিল লি বীজগণিত',
    'যেসব জটিল সংখ্যার বাস্তব অংশ শূন্য তাদেরকে বলা হয় কাল্পনিক সংখ্যা এবং এর বদলে তাদেরকে শুধুমাত্র দ্বারা প্রকাশ করা হয়',
    'অপারেশন',
    'এখান থেকে সহজেই দেখা যায় যে ',
    'শুধু মাত্র স্বীকার করে নেওয়া হয়েছে',
    'এখন আমরা লক্ষ্য করি যে',
    'যেখানে c এবং d এর অন্তত একটি শূন্য নয়',
    'যখন প্রতিটি বাস্তব সংখ্যা a কে জটিল সংখ্যা a + 0i আকারে প্রকাশ করা হয় তখন বাস্তব সংখ্যার ফিল্ড R জটিল সংখ্যার ফিল্ড C এর একটি উপফিল্ড গঠন করে',
    'একটি জটিল সংখ্যা এর পরম মান বা মডুলাস বা মান হিসাব করা হয় দ্বারা',
    'যদি এবং কেবল যদি z শুধু মাত্র কাল্পনিক হয় অর্থাৎ z এর বাস্তব অংশ শুন্য হয়',
    'যেখানে সমীকরণের সমাধান গুলো সেই ১৭ভুজের শীর্ষ বিন্দুগুলো কে প্রতিনিধিত্ব করে',
    'তখন এই আর্গুমেন্ট কে প্রিন্সিপাল আর্গুমেন্ট বলে',
    'পোলার ফর্মকে সাধারণত প্রকাশ করা হয়',
    'যেখান থেকে পাওয়া যায়',
    'যদি c = 0 হয় তখন c এর nতম মূল হয় শুধু মাত্র 0',
    'অসচ্ছতার সূচনা',
    'এর পর বীজগণিত শেখার সময় যখন তার প্রথম পরিচয় হয় ঋণাত্বক সংখ্যার সাথে',
    'আসলে সকল সংখ্যাই কাল্পনিক',
    'আসলে বীজগণিত শেখার শুরুতে একজন শিক্ষার্থী যেমন প্রশ্ন করে এই সমীকরণের বাস্তব অর্থ কি',
    'আক্ষরিক অর্থে',
    'বাস্তব এবং কাল্পনিক শব্দ দুটি অর্থবহ ছিল যখন জটিল সংখ্যাকে শুধু বাস্তব সংখ্যা সংক্রান্ত হিসাবে সাহায্যকারী ধারণা হিসাবে ব্যবহার করা হত',
    'যদি কোন সিস্টেমের পোল সমুহ',
    'যেখানে z হচ্ছে সেই সাইন তরঙ্গের জটিল সংখ্যায় প্রকাশিত রূপ',
    'যেখানে সিগন্যাল ট্রান্সমিট কম্প্রেস এবং পুনরুদ্ধারে ফুরিয়ার বিশ্লেষন এবং ওয়েভলেট বিশ্লেষন ব্যবহৃত হয়',
    'স্পেশাল রিলেটিভিটি এবং জেনারেল রিলেটিভিটির স্পেসটাইম বা স্থানকালের মেট্রিক সংক্রান্ত কিছু সমীকরণ অনেক সরল হয়ে যায় যদি সময় কে কাল্পনিক সংখ্যার চলক হিসাবে প্রকাশ করা হয় ক্লাসিক্যাল রিলেটিভিটিতে এধরণের ব্যবহার তেমন না থকলেও কোয়ান্টাম ফিল্ড থিওরীতে এটা অত্যাবশ্যক',
    'তথ্যসূত্র',
    'Commutative rule কমিউটেটিভ রুল্\u200c বিনিমেয় বিধি',
    'Topological closure টপোলজিক্\u200cল্\u200c ক্লৌঝ়ার্\u200c টপোগাণিতিক আবদ্ধতা',
    'পাকিস্তান তথা ইসলামী প্রজাতন্ত্রী পাকিস্তান উর্দু ভাষায় اسلامی جمہوریۂ پاکستان ইস্\u200cলামী জুম্\u200cহূরিয়াতে পাকিস্তান্\u200c দক্ষিণ এশিয়ায় অবস্থিত একটি দেশ',
    'এরপর এটি ব্রিটিশ শাসনের অধীনে আচে',
    'স সিন্ধ',
    'তথ্যসূত্র',
    'ইতিহাস',
    'তথ্যসূত্র',
    'প্রধান বৈশিষ্ট্য',
    'এটি সত্যি যে অধিকাংশ ওপেনসোর্স সফটওয়্যার স্বেচ্ছাসেবীরাই তৈরি করছে কিন্তু এর অনেক ব্যতিক্রমও আছে',
    'জার্মানির সাথে পরবর্তীতে ইতালি যুক্ত হয়ে অক্ষশক্তি হিসেবে আত্মপ্রকাশ করে',
    'এই ভয়াবহ যুদ্ধে আনুমানিক ৬ কোটি ২০ লক্ষ মানুষ মারা যায় যার মধ্যে প্রায় অর্ধেকই ছিল রাশিয়ার নাগরিক',
    'মহাযুদ্ধের ডামাডোলের মধ্যেই এই মারণাস্ত্র উদ্ভাবিত হয় এবং এর ধ্বংসলীলার মধ্য দিয়েই যুদ্ধের সমাপ্তি ঘটে',
    'এই কারণটি যুদ্ধোত্তর সময়ে মিত্রশক্তির দেশসমূহের মধ্যে তোষণ নীতির মাধ্যমে সমঝোতার ভিত্তি হয়ে দাঁড়ায় যা নির্দেশক শক্তির ভূমিকা পালন করে যুক্তরাষ্ট্র এবং ফ্রান্স',
    'সোভিয়েত ইউনিয়নকে নিষ্ক্রিয় রাখার জন্য জার্মানী অনাক্রমণ চুক্তি nonaggression treaty করে',
    'শেষ সেনাদল কক্ দূর্গে যুদ্ধ করে ৬ই অক্টোবর পর্যন্ত ',
    'ফলে যুদ্ধের ভাগ্য পরিষ্কার হয়ে গেল ',
    'ওদিকে মিত্রপক্ষ নারভিকের ঠিক বাইরের সমুদ্রে মাইন পেতে রাখার পরিকল্পনা করে ',
    'কিন্ত ততদিনে ফ্রাণ্সের পরিস্থিতি ঘোরালো হয়ে ওঠায় মিত্রসৈন্যদের ফিরিয়ে নিতে হল নরওয়ে থেকে ',
    'ডানকার্ক বন্দর দিয়ে তড়িঘড়ি ফরাসি ও BEF british expiditionary force সেনা পশ্চাদপসরণ শুরু হলো',
    'ফ্রান্সের বেশিরভাগ এলাকা জার্মানী নিয়ে নেয় ',
    'কিন্তু গ্রিকরা যে শুধু প্রতিহত করল তাই নাউল্টে ডিসেম্বরের মধ্যে আলবেনিয়ার এক তৃতীয়াংশ দখল করে ফেলল',
    '১৭ই এপ্রিল যুগোস্লাভিয়া ও ২২শে এপ্রিল গ্রিস আত্মসমর্পণ করে ',
    'আজ থেকে প্রায় ১৩৭ বিলিয়ন বছর আগে এই মহাবিশ্ব একটি অতি ঘন এবং উত্তপ্ত অবস্থা থেকে সৃষ্টি হয়েছিল',
    'মহা বিস্ফোরণের একটি উল্লেখযোগ্য ফলাফল হল বর্তমানকালে মহাবিশ্বের অবস্থা অতীত এবং ভবিষ্যতের অবস্থা থেকে সম্পূর্ণ পৃথক',
    'ফ্রিদমান সমীকরণ উপপাদনের পর কুণ্ডলাকার নীহারিকার ক্রম পশ্চাদপসারণের উপর ভিত্তি করে ল্যমেত্র্\u200c প্রস্তাব করেন যে মহাবিশ্ব একটি সুপ্রাচীন পরমাণু থেকে উৎপত্তি লাভ করেছে যে প্রস্তাব বর্তমানে মহা বিস্ফোরণ নামে পরিচিত',
    'একটি ফ্রেড হয়েলের স্থির অবস্থা নকশা যা অনুসারে মহাবিশ্ব যখন সম্প্রসারিত হতে শুরু করে তখন এখানে নতুন পদার্থ সৃষ্টি হতে পারে',
    'এর মধ্যে উল্লেখযোগ্য হচ্ছে মাইন নকশা Milne model রিচার্ড টলম্যান কর্তৃক প্রস্তাবিত কম্পনশীল মহাবিশ্ব এবং ফ্রিৎস জুইকি প্রস্তাবিত দুর্বল আলো প্রকল্প',
    'ফলে বর্তমান বিশ্বতত্ত্ববিদরা অনেক সহজে মহা বিস্ফোরণের বিভিন্ন রাশি পরিমাপ করতে পারে',
    'তাই এই সময়কে প্ল্যাংকের সময় বলা হয়',
    'এর হার ছিল প্রতি ১০১০ ভাগের এক ভাগ',
    'ফলে প্রতিপ্রোটন সম্পূর্ণ নিঃশেষ হয়ে যায় আর প্রোটন প্রায় নিঃশেষ হয়ে যায়',
    'এর সূত্র ধরে পদার্থ থেকে বিচ্ছিন্ন হয়ে যাওয়া শক্তি বিকিরণ আকারে সমগ্র মহাবিশ্বে ছড়িয়ে পড়ে কারণ একে তেমন কোন বাঁধার সম্মুখীন হতে হয়না',
    'অন্যান্য দুই ধরণের বস্তুর পরিমাণ মাত্র ২০',
    'এই সবগুলো পর্যবেক্ষণ বিশ্বতত্ত্বের ল্যাম্ব্\u200cডাসিডিএম নকশায় সংযুক্ত করা হয়েছে',
    'তত্ত্বের মৌলিক ভিত্তি',
    'মহাবিশ্বকে এই স্থানাংকসমূহ দ্বারা ব্যাখ্যা করলে দেখা যায় মহা বিস্ফোরণ একি শূন্য মহাবিশ্ব পূর্ণ করার জন্য কিছু পদার্থের নিছক একটি বিস্ফোরণ নয় বরং মহাশূন্য নিজেই সম্প্রসারিত হয়েছে নির্দিষ্ট নিয়মে এবং এর ফলে কমোভিং বিন্দুসমূহের ভৌত দূরত্ব বৃদ্ধি পেয়েছে',
    'এথেকে উদ্ভূত হয়েছে অতীত দিগন্তের ধারণা',
    'উপরন্তু মহাবিশ্বের বৃহৎপরিসর গঠনে পর্যবেক্ষণযোগ্য কোরিলেশন ফাংশন আদর্শ মহা বিস্ফোরণ তত্ত্বের সাথে বেশ ভাল রকম খাপ খায়',
    'এটি প্রস্তাব করেছিলেন ফ্রিদমানলেমাইট্\u200cররবার্টসনওয়াকার',
    'একই সাথে প্রাথমিক যুগের প্লাসমাগুলো একটি নিষ্ক্রিয় গ্যাসে রুপান্তরিক হয়',
    '১৯৮৯ সালে নাসা পটভূমি বিকিরণ অনুসন্ধানের জন্য একটি মহাকাশযান প্রেরণ করে যার নাম কসমিক ব্যাকগ্রাউন্ড এক্সপ্লোরার উপগ্রহ বা কোবে COBE',
    'এই নকশায় যে অনুপাতের ভর অনুসারে আশা করা হয়েছে তা অনেকটা এরকম',
    'ছায়াপথীয় বিবর্তন ও বন্টন',
    'তখন অনেকেই কিছু বিকল্প মহাজাগতিক নকশা বিশ্বাস করতো',
    'সমস্যাগুলোর মহাকর্ষীয় প্রভাব পর্যবেক্ষণ এবং তত্ত্বের মাধ্যসে বর্তমানে অনেকটাই বোধগম্য হয়েছে',
    'মহাবিশ্বের পূর্ণ জ্যামিতি নির্ধারিত হয় ওমেগা মহাজাগতিক মানদণ্ড ১এর চেয়ে বেশী না কম তার দ্বারা',
    'এর সমাধানে বলা হয়েছে বেরিওজেনেসিস নামক একটি অজ্ঞাত পদ্ধতি এই অপ্রতিসাম্যের সৃষ্টি করেছে',
    'কিন্তু মহা বিস্ফোরণ তত্ত্ব অনুসারে মহাবিশ্বের বয়স মাত্র ১৩৭ বিলিয়ন বছর',
    'এর পূর্বে ধারণা করা হত মহাবিশ্বের সকল পদার্থই সাধারণ যা আমরা দেখতে বা অনুধাবন করতে পারি',
    'এখন পর্যন্ত কোন গবেষণাগারে সরাসরি অদৃশ্য বস্তু পর্যবেক্ষণ করা সম্ভব হয় নি',
    'ধারণা করা হয় এই শক্তি অবশিষ্ট ৭০ গঠন করেছে',
    'মহাবিশ্ব যতই প্রসারিত হবে তত তার ঘনত্ব কমবে এবং এর ফলে আর নতুন তারা গঠিত হবে না',
    'অন্য একটি মতবাদ হচ্ছে ফ্যান্টম শক্তি মতবাদ',
    'তখন প্রকৃতপক্ষে কি ঘটেছিল তা সম্বন্ধে বিস্তারিত জ্ঞান পাওয়া যাবে যখন উচ্চ শক্তি স্কেলে পদার্থবিজ্ঞানের সূত্রসমূহ বোধগম্য হবে',
    'দার্শনিক ও ধর্মীয় ব্যাখ্যা',
    'খ্রিস্টান ধর্ম',
    'এমনকি ইসলামী চিন্তাবিদরা খতিয়ে দেখেছেন যে কুরআনে সম্প্রসারণশীল মহাবিশ্বের কথাও উল্লেখিত আছে সূরা আযযারিয়াত ২১ ৪৭',
    'আরও দেখুন',
    'মিথস্ক্রিয়াটি লক্ষ্য করার জন্য SunyaevZeldovich ক্রিয়া বিবেচনা করা হচ্ছে',
    'হল ছায়াপথ বা অন্যান্য জ্যোতিষ্কের প্রাস্থানিক বেগ recessional velocity',
    'চৌম্বক একমেরুসমূহ',
    'বিষয়শ্রেণীজ্যোতিঃপদার্থবিজ্ঞান',
    'কাল্পনিক একক কে বাস্তব সংখ্যাসমূহের সাথে যুক্ত করে জটিল সংখ্যা পাওয়া যায়',
    'তিনি এগুলিকে কাল্পনিক অভিধা দিয়েছিলেন',
    'সংজ্ঞা',
    'এখন যদি এবং হয় তখন বা লেখার বদলে সংখ্যাটিকে শুধু লেখা হয়',
    'বাস্তব সংখ্যার ক্রোমজোড় হিসাবে',
    'যদি ক্রোমজোড় টিকে আমরা z নাম দেই তাহলে লেখা হয়',
    'যদি আমাদের আলচ্য জটিল সংখ্যা দুইটির কাল্পনিক অংশ শুন্য হয় তাহলে এই অপারেশন দুইটি বাস্তব সংখ্যার অপারেশনে পরিণত হয়',
    'অর্থাৎ যেখান থেকে আমাদের পরিচিত এই ফর্মুলাটার সৃষ্টি',
    'জটিল সংখ্যার ফিল্ড',
    'জটিল সংখ্যার সার্বিক সেট Cকে বীজগাণিতিক সংখ্যাসমূহের টপোগাণিতিক আবদ্ধতা হিসেবে অথবা R এর বীজগাণিতিক আবদ্ধতা হিসেবে দেখানো যেতে পারে',
    'পরম মানের তিনটি গুরুত্বপূর্ণ বৈশিষ্ট্য হল',
    'যদি z অশুন্য হয়',
    'পোলার ফর্ম',
    'এভাবে কোন জটিল সংখ্যাকে তার পোলার কোঅর্ডিনেটে প্রকাশ করলে তাকে বলা হয় পোলার ফর্ম',
    'আকারে',
    'দুইটি জটিল সংখ্যার যোগ কোন ভেক্টর স্পেসে দুইটি ভেক্টরের যোগের মতই',
    'যেখানে nতম মূল হিসাবে এই 0 এর মাল্টিপ্লিসিটি n ধরা হয়',
    'জটিল সংখ্যা সম্পর্কে প্রথম অসচ্ছতার সূচনা হয় এর নামকরণ থেকে',
    'এই সংখ্যাকে সে প্রথমে একটু সন্দেহ প্রবন দৃষ্টিতে দেখে',
    'আমাদের অতিপরিতিত সংখ্যা 123 1 বা এরা সবই আমাদের মনের কল্পনা ',
    'a এর সাথে b কে যোগ করে কি লাভ',
    'একটি প্রচলিত বিভ্রান্তি',
    'যেখানে শুধু বাস্তব অংশ আক্ষরিক অর্থে বাস্তব জগৎএর প্রতিনিধত্ব করত',
    'ডান অর্ধতলে থাকে তাহলে এটা আনস্টেবল',
    'ফুরিয়ার বিশ্লেষণে সময় কোন সিগন্যালকে যেটা বাস্তব সংখ্যার একটি ফাংশন আকারে প্রকাশিত অনেক গুলো পর্যায়বৃত্ত ফাংশনের সমষ্টি আকারে প্রকাশ করতে জটিল সংখ্যার ফাংশন ব্যবহৃত হয়',
    'ইমপ্রোপ্রার ইন্টিগ্রাল',
    'আপেক্ষিকতায় ব্যহৃত স্পিনর সেটা টেন্সর এর একটা সাধারণীকৃত রূপ এর জন্যেও জটিল সংখ্যা অত্যাবশ্যক',
    'গাণিতিক তথ্যসূত্র',
    'Distributive rule ডিস্\u200cট্রিবিউটিভ্\u200c রুল্\u200c বণ্টন বিধি',
    'Algebraic closure অ্যাল্\u200cজিব্\u200cরেইক্\u200c ক্লৌঝ়ার্\u200c বীজগাণিতিক আবদ্ধতা',
    'দেশটি দক্ষিণ এশিয়া দক্ষিণপশ্চিম এশিয়া এবং মধ্য এশিয়ার সংযোগস্থলে অবস্থিত',
    '১৯৪৭ সালের আগস্টে এলাকাটি পাকিস্তান নামক রাষ্ট্রের পশ্চিম অংশ হিসেবে স্বাধীনতা লাভ করে',
    'তান বালুচিস্তান',
    'আরও দেখুন',
    'উইকিমিডিয়া ফাউন্ডেশন সান ফ্রান্সিস্কো',
    'বর্তমান ট্রাস্টি বোর্ডের সদস্যগণ',
    'বহিঃসংযোগ',
    'যথেচ্ছ বিতরণের অধিকার অর্থাৎ কপি করা বিক্রি করা ইত্যাদি ',
    'আসলে ওপেনসোর্স সফটওয়্যার বাণিজ্যে আয়ের মূল উৎস সফটওয়্যারের বিক্রিলব্ধ অর্থ নয় বরং সফটওয়্যার সার্ভিস থেকে প্রাপ্ত অর্থ',
    'জার্মানি কর্তৃক দখলকৃত কিছু দেশ হতেও অক্ষশক্তির বিরুদ্ধে সৈন্যবাহিনী প্রেরিত হয়',
    'নিহতের এই সুবিশাল সংখ্যার মূল কারণ ছিল কিছু গণহত্যামূলক অভিযান',
    'সকল পুনর্গঠন কাজ বাদ দিলে কেবল ১৯৪৫ সালেই মোট ব্যয়ের পরিমাণ দাড়ায় ১ ট্রিলিয়ন মার্কিন ডলার',
    'প্রথম বিশ্বযুদ্ধের পর জার্মানি এবং জাপানের আধিপত্য ও সম্রাজ্যবাদকে দায়ী করে এই কারণটি প্রতিষ্ঠা লাভ করে যার বিস্তারিত এখানে উল্লেখিত হচ্ছে',
    'অন্যদিকে ব্রিটেন ও ফ্রান্স পোল্যান্ডের সাথে সহায়তা চুক্তি করে ',
    'সোভিয়েত ফিনল্যান্ড যুদ্ধ',
    '৬ই মার্চ ১৯৪০ ফিনল্যান্ড শান্তির জন্য আবেদন করল ',
    'পরিকল্পনাটি ফাঁস হয়ে গেলে হিটলার ফ্রাণ্স আক্রমণের ইচ্ছা স্হগিত রেখে নরওয়ে অভিযানের নির্দেশ দিল ',
    'নরওয়ে বাহিনী আত্মসমর্পণ করলো এবং রাজা সপ্তম হাকোন ব্রিটেনে আশ্রয় নিলেন ',
    '২৬শে মে থেকে ৪ঠা জুন ইতিহাসের বৃহত্তম সেনা অপসারণের কাজ শেষ হলো ',
    'অল্প কিছু জায়গা জুড়ে পেঁত্যা একটি নিরপেক্ষ কিন্তু জার্মানীর প্রভাবাধীন সরকার গঠন করেন ',
    'উপরন্তু ক্রীটে ব্রিটিশ সৈন্য নামল',
    'এরপর ক্রীট দখল করা হয় ',
    'গুগলের প্রথম প্রজন্মের সার্ভার তৈরি হয়েছিলো বাজারে কিনতে পাওয়া সস্তা সব কম্পিউটার দিয়ে',
    'এই ধারণাটিকেই ভৌত বিশ্বতত্ত্বে মহা বিস্ফোরণ বা বৃহৎ বিস্ফোরণ বলে বোঝানো হয়',
    'এই তত্ত্বের মাধ্যমেই ১৯৪৮ সালে জর্জ গ্যামফ অনুমান করতে পেরেছিলেন যে মহাজাগতিক অণুতরঙ্গ পটভূমি বিকিরণের অস্তিত্ব রয়েছে',
    'এর দুই বছর পর এডুইন হাবল ল্যমেত্র্\u200cর তত্ত্বের সপক্ষে একটি পর্যবেক্ষণমূলক প্রমাণ উপস্থাপন করেন',
    'এই নকশা অনুসারে সময়ের যে কোন বিন্দুতে মহাবিশ্ব একইরকম থাকে',
    'কিছু সময়ের জন্য স্থির অবস্থা এবং মহা বিস্ফোরণ দুইটি তত্ত্বেরই যথেষ্ট গ্রহণযোগ্যতা ছিল বিধায় বিতর্কেরও অবকাশ ছিল প্রচুর',
    'এর ফলে একটি অপ্রত্যাশিত আবিষ্কার সম্ভব হয়েছে আর তা হলো সম্প্রসারণশীল মহাবিশ্বের ত্বরমান হওয়ার প্রমাণ দেখুন গুপ্ত শক্তি',
    'প্ল্যাংকের সময়ের প্রায় ১০−৩৫ সেকেন্ড পর একটি দশা পরিবর্তন তথা অবস্থান্তর অবস্থার সূচনা ঘটে যার ফলে মহাজাগতিক স্ফীতি শুরু হয়',
    'এই প্রক্রিয়াকে বেরিওজেনেসিস বলা হয়',
    'তবে কিছু প্রোটন থেকে যায়',
    'এই সুপ্রাচীন বিকিরণের নাম মহাজাগতিক ক্ষুদ্রতরঙ্গ পটভূমি বিকিরণ',
    'বর্তমান মহাবিশ্বের অধিকাংশ স্থান জুড়ে একটি রহস্যময় ধরণের শক্তি বিরাজ করছে',
    'সবগুলো নকশার নির্যাস নিয়ে গঠিত এই নকশাটি মূলত গাণিতিক যাতে ছয়টি মুক্ত স্থিতিমাপ parameter রয়েছে',
    'মহা বিস্ফোরণ তত্ত্ব নিম্নলিখিত অনুমিতিগুলোর উপর নির্ভর করে',
    'যে বস্তুসমূহ একীভূত থাকে যেমন পরমাণু মানুষ তারা সৌর জগত ছায়াপথ তারা স্থানকালের প্রসারণের সাথে প্রসারিত হয়ে একে অন্যের থেকে দূরে সরে যায়না কারণ যে বল তাদেরকে একীভূত করে রেখেছে তা হাবল সম্প্রসারণের জন্য দায়ী বলের চেয়ে শক্তিশালী',
    'মহাবিশ্ব যদি ত্বরণ সহকারে সম্প্রসারিত হতে থাকে তাহলে কেবল একটি সুনির্দিষ্ট সংখ্যাক কনফরমাল সময় ভবিষ্যতের জন্য রয়েছে',
    'হাবলের নীতি',
    'মহাজাগতিক ক্ষুদ্রতরঙ্গ পটভূমি বিকিরণ',
    'এই প্রকিয়ার নাম ফোটন ডিকাপলিং',
    'এই কৃত্রিম উপগ্রহ থেকে ১৯৯০ সালে প্রাপ্ত তথ্য পটভূমি বিকিরণ সম্বন্ধে মহা বিস্ফোরণ তত্ত্বের ধারণাকে সমর্থন করে',
    '৪HeH এর জন্য প্রায় ০২৫',
    'সূক্ষ্ণ বিশ্লেষণ করলে দেখা যায় ছায়াপথ এবং কোয়াসারসমূহের অন্তর্গঠন এবং বৃহৎ পরিসর গঠনের বন্টন ব্যবস্থা মহা বিস্ফোরণ তত্ত্বকে সমর্থন করে',
    'এগুলো নিয়েই গড়ে উঠেছে অপ্রমিত বিশ্বতত্ত্ব Nonstandard Cosmology',
    'কিন্তু এই তত্ত্বগুলোকে কণা পদার্থবিজ্ঞানের আদর্শ নকশার মধ্যে সঠিকভাবে বিন্যস্ত করা হয় নি',
    'উপর থেকে নিচে একটি বদ্ধ মহাবিশ্বে জ্যামিতি উন্মুক্ত মহাবিশ্বে এবং সমতল মহাবিশ্বে',
    'বেরিওজেনেসিস ঘটার জন্য শাখারভ শর্তগুলো অবশ্যই পূর্ণ হতে হবে',
    'অবশ্য এই সমস্যাটি কয়েক বছর পরই সমাধান হয়ে যায় যখন কম্পিউটার সিমুলেশনে আরও উন্নত প্রযুক্তির আবির্ভাব ঘটে',
    'কিন্তু এই ধারণা পর্যবেক্ষণের সাথে সামাঞ্জস্যহীন ছিল',
    'কণা পদার্থবিজ্ঞানের অনেক গুরুত্বপূর্ণ গবেষণার বিষয় বর্তমানে অদৃশ্য বস্তু',
    'এর প্রকৃতি বর্তমান মহা বিস্ফোরণ তত্ত্বের অন্যতম রহস্যময় বিষয়',
    'মহাবিশ্বের গড় তাপমাত্রা এসিম্পটোটিকভাবে পরম শূন্যের দিকে অগ্রসর হবে এবং মহা হিমায়ন big freeze অবস্থার সৃষ্টি হবে',
    'এটি অনুসারে ছায়াপথ স্তবক তারা গ্রহ পরমাণু বা কেন্দ্রীন সবগুলোই এক সময় ছিন্নভিন্ন হয়ে যাবে এবং চির প্রসারণশীল মহাবিশ্বে এ কারণে এক সময় বিগ রিপ সৃষ্টি হবে',
    'এ সম্বন্ধে সকল অনুমান কোয়ান্টাম মহাকর্ষ হিসেবে আলোচিত হয়',
    'মহা বিস্ফোরণ একটি বৈজ্ঞানিক তত্ত্ব কোন ধর্মের উপর ভিত্তি করে এটি তৈরি করা হয় নি',
    'বেশ কিছু খ্রিস্টান এবং প্রথাগত ইহুদী গোষ্ঠী বিভিন্ন তথ্যসূত্রের সাপেক্ষে বিশ্বাস করে যে মহা বিস্ফোরণ মহাবিশ্ব সৃষ্টির একটি সম্ভাব্য উপায় হতে পারে',
    'মহা সংকোচন এবং কম্পনশীল মহাবিশ্বের তত্ত্বও কুরআনের সমর্থন লাভ করেছে সূরা আম্বিয়া ২১ ১০৪',
    'মহা বিস্ফোরণের চিত্রলৈখিক কালপঞ্জি',
    'এক্ষ্রতে শতকরা ১ ভাগ বিশুদ্ধতার আশা করা যায়',
    'হল বস্তুটির দূরত্ব এবং',
    '১৯৭০এর দশকের শেষ ভাগে প্রথম চৌম্বক একমেরু ধারণাটি উত্থাপিত হয়',
    'বিষয়শ্রেণীভৌত বিশ্বতত্ত্ব',
    'কে নিচের সমীকরণের সাহায্যে সংজ্ঞায়িত করা হয়',
    'সাধারণ ত্রিঘাত সমীকরণের সমাধান প্রক্রিয়ায় অনেক মধ্যবর্তী হিসেবের সময় এমন কিছু পদ চলে আসে যেগুলোতে ঋণাত্মক সংখ্যার বর্গমূল থাকে এমনকি যখন মূল সমাধানে শুধু বাস্তব সংখ্যা থাকে তখনও',
    'প্রতীক পদ্ধতি',
    'কিছু কিছু ক্ষেত্রে বিশেষ করে তড়িৎ প্রকৌশলের বিভিন্ন অনুষদে যেখানে দ্বারা বর্তনীর বিদ্যুৎ প্রবাহ নির্দেশ করা হয় কাল্পনিক একককে এর বদলে দ্বারা প্রকাশ করা হয়',
    'জটিল সংখ্যাকে বাস্তব সংখ্যার একটি ক্রোমজোড় হিসেবে উপস্থাপন করা যেতে পারে যেখানে সংখ্যাটি হচ্ছে জটিল সমতলে একটি বিন্দু যেখানে x এবং y হচ্ছে দিগাক্ষ',
    'যেখানে',
    'অর্থাৎ এবং এর জন্য',
    'যদিও বর্গমূল অপারেশন টি ঋণাত্বক সংখ্যার উপর ধনাত্বক সংখ্যার মত করে সংজ্ঞায়িত নয়',
    'একটি ফিল্ড হচ্ছে একটি বীজগাণিতিক সংগঠন যার যোগ বিয়োগ গুণ এবং ভাগের অপারেশনগুলি কিছু নির্দিষ্ট বীজগাণিতিক নিয়ম মেনে চলে',
    'নিচে উভয়েরই বর্ণনা দেওয়া হল',
    'যেখানে হবে যদি এবং কেবল যদি হয়',
    'শেষের সূত্রটি বিশেষ ভাবে ব্যবহৃত হয় যখন z কে কার্টেসিয়ান কোঅর্ডিনেটে দেওয়া থাকে',
    'z = x+iy এর কার্টেসিয়ান রিপ্রেজেন্টেশন কে পোলার ফর্মেও প্রকাশ করা হয়',
    'পোলার ফর্ম থেকে কার্টেসিয়ান ফর্মে রূপান্তর',
    'এটাকে বলা হয় ত্রিকোনমিতিক ফর্ম কখনো কখনোcis φ দ্বারা cos φ + i sin φ বোঝানো হয় তখন লেখা হয় z = r cis φ',
    'আর দুইটি জটিল সংখ্যার গুন কে দেখা যেতে পারে একই সাথে প্রয়োগ করা একটা রোটেশন বা ঘুর্ণন এবং স্ট্রেচিং বা বিবর্ধনের মত',
    'জটিল সংখ্যা সংক্রান্ত প্রচলিত ধারণা এবং অসচ্ছতা',
    'ইংরেজি বা বাংলা সব ভাষায় এই সংখ্যার পরিভাষা হচ্ছে কম্পলেক্স ইমাজিনারি অবাস্তব কাল্পনিক এবং সর্বোপরি জটিল সংখ্যা',
    'কারণে এই সংখ্যার বাস্তব উদারণ সৃষ্টি করা সহজ সাধ্য নয়',
    'এসব সংখ্যাকে আমরা কল্পনা করে নিয়েছি আমাদের বাস্তব জীবনের বিভিন্ন সমস্যা সমাধানের জন্য',
    'a বা b কি কোন সংখ্যা হতে পারে',
    'আমরা যখন জটিল সংখ্যার কাল্পনিক একক কে হিসাবে দেখি তখন সহজেই একটা সমীকরণে পৌছতে পারি',
    'পরবর্তীকালে বিশেষ করে কোয়ান্টাম বলবিজ্ঞানের আবিষ্কারের পরে দেখা যায় যে বাস্তব সংখ্যার প্রতি প্রকৃতির কোন অতিরিক্ত প্রীতি নেই',
    'বাম অর্ধতলে থাকে তাহলে স্টেবল',
    'এক্ষেত্রে ব্যবহৃ পর্যায়বৃত্ত ফাংশনগুলি এই',
    'ফলিত গণিতে অনেক বাস্তব সংখ্যার ফাংশনের ইম্প্রোপার ইন্টিগ্রাল বের করার জন্য জটিল সংখ্যার ফাংশন ব্যবহৃত হয়',
    'ফলিত গণিত',
    'ঐতিহাসিক তথ্যসূত্র',
    'Algebraic structure অ্যাল্\u200cজিব্\u200cরেইক্\u200c স্ট্রাক্\u200cচার্\u200c বীজগাণিতিক সংগঠন',
    'বহিঃসংযোগ সমূহ',
    'পাকিস্তান ভারতীয় উপমহাদেশের অংশ',
    'দেশের অন্য অংশ পূর্ব পাকিস্তান পশ্চিম পাকিস্তান থেকে প্রায় ১৬০০ কিলোমিটার দূরে অবস্থিত ছিল',
    '১৯৩৪ সালে চৌধুরী রহমত আলী তাঁর নাও অর নেভার Now or Never পুস্তিকায় এই নামটির প্রস্তাব রাখেন ',
    'বহিঃসংযোগ',
    'উইকিমিডিয়া ফাউন্ডেশন একটি আন্তর্জাতিক অলাভজনক প্রতিষ্ঠান',
    'উপদেষ্টামন্ডলী',
    'উইকিমিডিয়া ফাউন্ডেশন ওয়েবসাইট',
    'উন্মুক্ত সোর্স কোড ',
    'সফটওয়্যার সার্ভিস বলতে বোঝায় সফটওয়্যারের কাস্টমাইজড সংস্করণ তৈরি উন্নতকরণ নির্দেশিকা বিক্রি প্রশিক্ষণ প্রদান ইত্যাদি',
    'বিশেষত পূর্ব সীমান্তের যুদ্ধে এই সকল দেশের সৈন্যরা অংশগ্রহণ করে অন্যান্য জাতিসমূহ মিত্রশক্তির সাথে যোগদান করে',
    'যেমন',
    'এই যুদ্ধের পরপরই সমগ্র ইউরোপ দুই ভাগে ভাগ হয়ে যায় এক অংশ হয় পশ্চিম ইউরোপ আর অন্য অংশে অন্তর্ভুক্ত হয় সোভিয়েত রাশিয়া',
    'প্রথম বিশ্বযুদ্ধের পর জার্মানি তার সম্পদ সম্মান এবং ক্ষমতার প্রায় সবটুকুই হারিয়ে বসে',
    '১লা সেপ্টেম্বর পোল্যান্ড অভিযান শুরু হল ',
    'জার্মানী বনাম মিত্রপক্ষ ভুয়াযুদ্ধ চলাকালীন সময় সোভিয়েত ইউনিয়ন ফিনল্যান্ড আক্রমণ করে শীতকালীন যুদ্ধের সূচনা করল ',
    'সার্বভৌমত্ব রক্ষা পেলেও সইউনিয়নের আগের দাবী্ অনুযায়ী লেলিনগ্র্রাদের কাছাকাছি বেশকিছু এলাকার মালিকানা ছেড়ে দিতে হয় ফিনল্যান্ডকে ',
    '৯ই এপ্রিল একই সাথে নরওয়ে ও ডেনমার্কে নরওয়ের সাথে যোগাযোগের সুবিধার্থে আগ্রাসন শুরু হল ',
    'জার্মানীর জন্য নরওয়ে আর্কটিক সাগর এবং ব্রিটেনের নিকটবর্তী একটি দরকারী নৌ ও বিমান ঘাঁটি হিসেবে কাজে দিল ',
    'তবে ফেলে আসতে হলো বেশীরভাগ যন্ত্রাদি',
    'এটি ভিশি ফ্রান্স নামে পরিচিত হয় ',
    'তুরষ্কও সৈন্যসমাবেশ করে রাখল ',
    'যুগোস্লাভিয়াকে খন্ডবিখন্ড করে অক্ষশক্তিরা ভাগ করে নেয় ',
    'গুগল এডসেন্সগুগল অনুসন্ধান ওয়েবের বৃহত্তম অনুসন্ধান ইঞ্জিন',
    'বিজ্ঞানী এডুইন হাবল প্রথম বলেন দূরবর্তী ছায়াপথসমূহের বেগ একসাথে করে পর্যালোচনা করলে দেখা যায় এরা পরষ্পর দূরে সরে যাচ্ছে অর্থাৎ মহাবিশ্ব ক্রমশ সম্প্রসারিত হচ্ছে',
    '১৯৬০এর দশকে এটি আবিষ্কৃত হয় এবং স্থির অবস্থা তত্ত্বকে অনেকটাই বাতিল করে মহা বিস্ফোরণ তত্ত্বকে প্রমাণ করতে সমর্থ হয়',
    'তিনি আবিষ্কার করেন যে পৃথিবী থেকে দৃশ্যমান ছায়াপথসমূহ থেকে নিঃসৃত আলোর লোহিত অপসারণ হচ্ছে এবং এই অপসারণ পৃথিবী থেকে তাদের দূরত্বের সমানুপাতিক',
    'অন্যটি হল ল্যমেত্র্\u200cর মহা বিস্ফোরণ তত্ত্ব যা মূলত জর্জ গ্যামফ কর্তৃক পূর্ণতা লাভ করেছে',
    'কিন্তু সময়ের আবর্তে অনেকগুলো গুরুত্বপূর্ণ পর্যবেক্ষণ সাধিত হয় যার অধিকাংশই প্রথমটির বদলে দ্বিতীয় তত্ত্বের গ্রহণযোগ্যতার সাক্ষ্য দেয়',
    'সাধারণ আলোচনা',
    'এই সময় মহাবিশ্ব সম্প্রসারিত হতে শুরু করে',
    'মহাবিশ্বের আয়তন যত বৃদ্ধি পেতে থাকে ততই এর তাপমাত্রা কমতে থাকে',
    'নিউট্রনপ্রতিনিউট্রন জোড়ের ক্ষেত্রেও একই ঘটনা ঘটে',
    'সম্প্রসারণের সাথে সাথে মহাবিশ্বের বন্টন প্রায় সুষম হয়েছিলো',
    'মহাবিশ্বের বিপুল ভর ও শক্তির জন্য সবচেয়ে বেশী দায়ী এই শক্তিকে অদৃশ্য শক্তি বা dark energy বলা হয়',
    'তবে রহস্যজনক পরিস্থিতির সৃষ্টি হয় যখন আমরা মহাবিশ্বের সৃষ্টির গোড়ার দিকে দৃষ্টি নিক্ষেপ করি',
    'ভৌত নীতিসমূহের সর্বজনীনতা',
    'আমরা এখানে কনফরমাল সময় নামক শব্দটির অবতারণা করতে পারি এহেন ক্ষেত্রে সম্পূর্ণ স্থানকাল মেট্রিক একটি স্থিতিশীল মেট্রিকের রুপ নেয় এবং এটি এই মেট্রিককে সামগ্রিক স্কেল উৎপাদক দ্বারা গুণ করে মূল মেট্রক পাওয়া যায়',
    'একে দ্বারা প্রকাশ করা গয়ে থাকে',
    'হাবলকৃত ১৯২৯ সালের একটি গবেষণাপত্র থেকে প্রাপ্ত হাবলের মূল গবেষণা',
    'ডব্লিউএমএপি থেকে প্রাপ্ত মহাজাগতিক ক্ষুদ্রতরঙ্গ পটভূমি বিকিরণের চিত্র',
    'তখন মহাবিশ্বে কেবল নিরপেক্ষ পরমাণু এবং বিভিন্ন গ্যাসীয় বস্তুর সমন্বয়ে একটি নিষ্ক্রিয় পরিবেশ বিরাজ করছিল',
    'কোবে কর্তৃক প্রাপ্ত অবশেষ তাপমাত্রার residual temperature পরিমাণ ছিল ২৭৩৬ কেলভিন',
    '২HH এর জন্য প্রায় ১০৩',
    'এ ধরণের সকল পর্যবেক্ষণ পর্যালোচনা করে জানা যায় যে মহা বিস্ফোরণ সংঘটিত হওয়ার প্রায় এক বিলিয়ন বছর পর প্রথম ছায়াপথ এবং কোয়াসার সৃষ্টি হয় আর তখন থেকেই তৈরি হতে থাকে আরও বৃহৎ পরিসরের গঠন যেমন ছায়াপথ স্তবক এবং মহা স্তবক',
    'সময়ের সাথে সাথে অনেক বিতর্কেরও সৃষ্টি হয়েছে যার মূল উদ্দেশ্য ছিল ঠিক কোন নকশাটি জ্যোতির্বৈজ্ঞানিক পর্যবেক্ষণের সাথে সবচেয়ে ভাল খাপ খায় তা বের করা',
    'মৌলিক পদার্থবিজ্ঞান দ্বারা অনেকগুলোর উত্তর বের করার চেষ্টা করা হয়েছে আর এ থেকেই বিভিন্ন তত্ত্বের সৃষ্টি হয়েছে',
    'সমতা সমস্যা একটি পর্যবেক্ষণিক সমস্যা যার ফ্রিদমানলেমাইট্\u200cররবার্টসন ওয়াকার মেট্রিকের সাথে সম্পর্কিত',
    'বিজ্ঞানী আন্দ্রেই শাখারভ এই শর্তগুলো উত্থাপন করেন',
    'এ সময় নাক্ষত্রিক বায়ুর প্রভাব ধরা হয় এবং স্তবকগুলোর বয়স আরও কম পাওয়া যায়',
    'অদৃশ্য বস্তুর ধারণা বাদ দিলে মহাবিশ্বে যে পরিমাণ ডিউটেরিয়াম থাকা উচিত ছিল বর্তমানে তার চেয়ে অনেক কম রয়েছে',
    'অদৃশ্য শক্তি',
    'এর সম্ভাব্য সমাধান পাওয়া যায় মহাজাগতিক ধ্রুবকের স্কেলার মান গ্রহণ এবং ভৌত শূণ্য স্থান গঠনকারী কুইনটেসেন্সের পরিমাণ ধরে নেয়া',
    'এ সময় কৃষ্ণ গহ্বরসমূহ স্বতঃ বাষ্পীভূত হবে',
    'মহা বিস্ফোরণের সীমানা পেরিয়ে অনুমানমূলক পদার্থবিজ্ঞান',
    'কয়েকটি প্রস্তাবনা হচ্ছে',
    'কিছু ব্যক্তি অন্য অনেক মতের সাথে এই তত্ত্বের মিল খুঁজে পেয়েছেন',
    'তারা এটিকে দার্শনিক প্রথম কারণ হিসেবে আখ্যায়িত করে',
    'অন্যান্য',
    'মহা বিস্ফোরণের কালপঞ্জি',
    'এই অনুমিতিগুলোকে আইনস্টাইনের সাধারণ আপেক্ষিকতা তত্ত্বের সাথে একীভূত করলে বোঝা যায় যে স্থানকালকে একটি সমসত্ব ও আইসোপট্রপীয় মেট্রিক হিসেবে বর্ণনা করতে হবে',
    'হল হাবলের ধ্রুবক ডব্লিউএমএপির মাধ্যমে পরিমাপকৃত এর আপাত মান হচ্ছে ৭০ +২৪৩২ কিমিসMpc',
    'মহা একীভূত তত্ত্ব অনুসারে ভবিষ্যৎ বাণী করা গিয়েছিল যে মহাকাশে বেশ কিছু বিন্দু ত্রুটি রয়েছে যারা স্বাভাবিক পর্যবেক্ষণের চেয়ে অনেক বেশী ঘনত্ব বিশিষ্ট চৌম্বক একমেরু হিসেবে প্রকাশিত হতে পারে',
    'প্রতিটা জটিল সংখ্যাকেই আকারে লেখা যায় যেখানে a এবং b বাস্তব সংখ্যা',
    'এই পর্যবেক্ষণ থেকেই বীজগণিতের মৌলিক উপপাদ্যের সৃষ্টি',
    'একটি জটিল সংখ্যাকে সাধারণত আকারে প্রকাশ করা হয় যেখানে a এবং b হচ্ছে বাস্তব সংখ্যা এবং হচ্ছে কাল্পনিক একক যেটি সূত্রটি মেনে চলে',
    'তাই জটিল সংখ্যাকে কখনো কখনো আকারে লিখতে দেখা যায়',
    'ঠিক যেমন বাস্তব সংখ্যাগুলিকে সংখ্যা রেখার উপর একটি বিন্দু হিসেবে প্রকাশ করা হয়',
    'এবং ',
    'অর্থাৎ জটিল সংখ্যা পদ্ধতি আসলে আসলে বাস্তব সংখ্যা পদ্ধতির একটা নেচারাল এক্সটেনশন বা প্রাকৃতিক প্রবৃদ্ধি',
    'এই নোটেশনাল অ্যাবিউজ এর জন্য আমাদের প্রায়ই কিছু ভুল উপসংহারে পৌছাতে হয়',
    'জটিল সংখ্যাগুলি একটা ফিল্ড গঠন করে যাকে C দ্বারা প্রকাশ করা হয়',
    'জটিল সমতল',
    'ট্রায়াঙ্গুলার ইনইকুয়ালিটি',
    'জটিল সংখ্যার অপারেশন সমুহের জ্যামিতিক ব্যাখ্যা',
    ' z এর আনুসাঙ্গীক পোলার কোঅর্ডিনেট দুটি হচ্ছে r = |',
    'কার্টেসিয়ান ফর্ম থেকে পোলার ফর্মে রূপান্তর',
    'অয়লারস ফর্মুলা বা অয়লারের সূত্র ব্যবহার করে জটিল সংখ্যার আরেকটা সুন্দর রিপ্রেজেন্টেশন হচ্ছে',
    'i দিয়ে গুন করা কে দেখা যেতে পারে ঘড়ির কাটার বিপরীত দিকে একটা 90 ডিগ্রি π2 রেডিয়ান ঘুর্ণন হিসাবে',
    'জটিল সংখ্যা কতটা জটিলবাস্তবঅবাস্তবকাল্পনিক',
    'নাম শুনেই শিক্ষার্থীদের মনে সন্দেহপ্রবনতার সৃষ্টি হওয়া স্বাভাবিক',
    'তার পরে একক সময় সে হয়ত এটা বুঝতে সেখে ঋণ এর ধারণা থেকে',
    'এবং পর্যবেক্ষনের সাহায্যে নিশ্চিত হয়েছি যে আদর্শ অবস্থায় আমাদের গাণিতিক সমাধান গুলো ব্যবহারিক সমস্যার সমাধান হিসেবেও কাজ করে',
    ' তেমনই জটিল সংখ্যা নাম শুনে এবং আর এধরণের তখন পর্যন্ত তার গাণিতিক ধারণা অনুযায়ি প্রথা বিরুদ্ধ সমীকরণ দেখে এবং এদের নাম জটিল অবাস্তব এসব দেখে সে নিজেও এটাকে অবাস্তব ভাবতে শুরু করে',
    'এই সমীকরণ ও শিক্ষার্থীদের কাছে জটিল সংখ্যাকে জটিল বা অবাস্তব মনে হবার আরেকটা কারণ',
    'বরং অনেক বাস্তব ঘটনাই গাণিতিকভাবে বর্ণনার সময় জটিল সংখ্যা অত্যাবশ্যক হয়ে পড়ে',
    'যদি মাঝের অক্ষের উপর থাকে তাহলে এটা মারজিনাল স্টেবল',
    'আকারের',
    'এধরনে বিভিন্ন পদ্ধতি রয়েছে',
    'ডিফারেন্সিয়াল ইকুয়েশনের সমাধানের সময় সাধারণত প্রথমে ক্যারেক্ট্যারিস্টিক ইকুয়েশনের জটিল মূল গুলো নির্ণয় এবং এর পরে পুরো সিস্টেম কে ft = ert আকারের বেস ফাংশনের সাপেক্ষে সমাধান করা হয়',
    'আরো তথ্যের জন্য দেখুন',
    'Additive identity অ্যাডিটিভ্\u200c আইডেন্\u200cটাটি যোগাত্মক অভেদ',
    'দেশটির প্রায় হাজার কিলোমিটার লম্বা সৈকতরেখা আছে',
    '১৯৭১ সালে পূর্ব পাকিস্তান পাকিস্তান থেকে বিচ্ছিন্ন হয়ে যায় এবং স্বাধীন গণপ্রজাতন্ত্রী রাষ্ট্র বাংলাদেশ গঠন করে',
    '\u200d১৯৪৭ সালে ভারতীয় উপমহাদেশ বিভাজনের মাধ্যমে ভারত ও পাকি\u200dস্তান এ দুটি দেশের জ\u200c',
    'বিষয়শ্রেণীদক্ষিণ এশিয়া',
    'যৌনসঙ্গম বা হস্তমৈথুন কালে যখন পুরুষের শিশ্নটি পুং জননাঙ্গ বা লিঙ্গ যৌন উত্তেজনায় সোজা হয়ে ওঠে এবং যৌনউত্তেজনার চরম পর্যায়ে তখন তা থেকে রেতঃ অর্থাৎ বীর্য স্খলিত হয় এই ঘটনাকেই বলা হয় বীর্যপাত বা বীর্যস্খলন',
    'এর প্রধান কার্যালয় মার্কিন যুক্তরাষ্ট্রের ক্যালিফোর্নিয়া অঙ্গরাজ্যের সান ফ্রান্সিস্কো শহরে',
    'উইকিমিডিয়া প্রকল্পসমূহ',
    'উইকিমিডিয়া ব্লগ',
    'মূল সফটওয়্যারকে ইচ্ছামত পরিবর্তন ও পরিবর্তিত সংস্করণকে বিতরণের অধিকার ',
    'সর্বাধিক সফল ওপেনসোর্স কোম্পানি সম্ভবত রেডহ্যাট',
    'সোভিয়েত ইউনিয়ন জার্মানির সাথে যেকোন ধরণের আক্রমণ থেকে বিরত থাকার মর্মে Nonaggression Treaty নামে একটি চুক্তি সম্পাদন করেছিল',
    'হলোকাস্ট',
    'পরবর্তীতে এই রাশিয়ান ইউনিয়নই ভেঙে অনেকগুলো ছোট ছোট রাষ্ট্রের জন্ম হয়েছিল',
    'এর সম্রাজ্যবাদী চিন্তাধারার মূল কারণ ছিল জার্মানির হৃত অর্থনৈতিক সামরিক এবং ভূমিকেন্দ্রিক সম্পদ পুনরুদ্ধার করা এবং পুনরায় একটি বিশ্বশক্তি হিসেবে আত্মপ্রকাশ করা',
    '৩রা সেপ্টেম্বর মিত্রবাহিনী জার্মানীর বিরুদ্ধে যুদ্ধ ঘোষণা করলএবং শুরু হল দ্বিতীয় বিশ্বযুদ্ধ ',
    'এর আগেই লিথুনিয়া লাটভিয়া ও এস্তোনিয়ায় সোভিয়েত সৈন্য প্রবেশ করে ক্ষতিপূরণ সহ একটি অনুরূপ প্রস্তাবে ফিনল্যান্ড রাজী না হওয়ায় ৩০শে নভেম্বর ১৯৩৯ সইউনিয়ন ফিনল্যান্ড আক্রমণ করল ',
    'এ যুদ্ধে ২ লক্ষ ফিন সৈন্যের মধ্যে ৭০ হাজার সৈন্য মারা যায় ',
    'একদিকে নারভিক সহ গুরুত্বপূর্ণ বন্দরগুলি দখল করে নিল জার্মান বাহিনী ',
    'ফ্রান্স বেলজিয়াম নেদারল্যান্ড লুক্সেমবার্গ',
    'এরমাঝে ২৭শে মে বেলজিয়ামের পতন হলো ',
    'বাল্টিক অঞ্চল',
    'আপাতনিরপেক্ষ বুলগেরিয়া এবং যুগোস্লাভিয়াও বেঁকে বসল',
    'তবে পুরো যুদ্ধ জুড়ে draža mihajlovićএর নেতৃত্বে Četnikদল এবং জোসেফ টিটোর নেতৃত্বে কমিউনিস্ট দল গেরিলা আক্রমণ চালিয়ে যায় ',
    'গুগলের লক্ষ্য বিশ্বের যাবতীয় তথ্য সুবিন্যস্ত করা এবং সেগুলো সর্বসাধারণের জন্য উপযোগী করে প্রকাশ করা',
    'আপেক্ষিকতার সাধারণ তত্ত্বের ফ্রিদমানল্যমেত্র্\u200cরবার্টসনওয়াকার নকশা অনুসারে এটি ব্যাখ্যা করা হয়েছে',
    'ইতিহাস',
    'অর্থাৎ একটি ছায়াপথ পৃথিবী থেকে যত দূরে তা থেকে নিঃসৃত আলোর বর্ণালীর মধ্যে ততই লাল আলো প্রকট হয়ে উঠছে',
    'ল্যমেত্র্\u200cর এই তত্ত্বটির নাম কিন্তু হয়েলই দিয়েছিলেন',
    '১৯৬৪ সালে মহাজাগতিক অণুতরঙ্গ পটভূমি বিকিরণ আবিষ্কৃত হওয়ার পর মহা বিস্ফোরণ তত্ত্ব মহাবিশ্বের উৎপত্তি ও বিবর্তন ব্যাখ্যার জন্য সবচেয়ে উপযোগী তত্ত্ব হিসেবে গৃহীত হয়',
    'আরও দেখুন মহা বিস্ফোরণের কালপঞ্জি',
    'এ সময় থেকে মূলত মহাবিশ্বের exponential সম্প্রসারণ শুরু হয়',
    'তাপমাত্রা হ্রাসের সময়ই কোন এক পর্যায়ে দশার অবস্থান্তর অবস্থা সৃষ্টি হয় যার ফলে শুরু হয় প্রতিসাম্য ভাঙন',
    'ইলেকট্রন ও প্রতিইলেকট্রন বা পজিট্রনের ক্ষেত্র এই ঘটনা আরও নিম্ন তাপমাত্রায় সংঘটিত হয়',
    'কিন্তু এর মাঝেও কিছু অসামঞ্জস্যতা ছিল',
    'বর্তমান মহাবিশ্বের মোট শক্তি ঘনত্বের শতকরা প্রায় ৭০ ভাগ জুড়োই রয়েছে এই অদৃশ্য শক্তি',
    'সেই সময় পদার্থ কণিকার শক্তি এতো বেশী ছিল যে বর্তমান কালের পরীক্ষণেও তা নিয়ে বাস্তবমুখী গবেষণা করা যায়না',
    'মহাজাগতিক মূলনীতি',
    'কনফরমাল সময় স্থানাংক বেশ গুরুত্বপূর্ণ',
    'অবশ্য এই কনফরমাল সময়টি আমাদের ঘড়ির তুলনায় প্রায় অসীম যাকে সঠিক সময় proper time বলা হয়',
    'দূরবর্তী ছায়াপথ ও কেয়াসার পর্যবেক্ষণ করে দেখা গেছে যে এরা লাল অপসারণ প্রদর্শন করে তাদের থেকে নিঃসরিত আলোর তরঙ্গদৈর্ঘ্য তুলনামূলক বর্ধিত তরঙ্গদৈর্ঘে রুপ নেয়',
    'মহা বিস্ফোরণ তত্ত্ব মহাজাগতিক ক্ষুদ্রতরঙ্গ পটভূমি বিকিরণের অস্তিত্বের কথা বলেছিল',
    'ফলে পদার্থ থেকে নিঃসরিত বিকিরণ কোন বাঁধা ছাড়াই সমগ্র মহাবিশ্ব পরিভ্রমণের সুযোগ পায়',
    'আরো জানা যায় সিএমবি প্রতি ১০৫ ভাগে এক ভাগ মাত্রায় আইসোট্রপীয়',
    '৩HeH এর জন্য প্রায় ১০৪',
    'ছায়াপথগুলোর বয়স ধীরে ধীরে বাড়ছে আর সেই সাথে তাদের মধ্যে ঘটছে নানা বিবর্তন',
    'বর্তমানে মহা বিস্ফোরণ তত্ত্ব জনপ্রীয়তা লাভ করায় এই বিতর্কগুলোকে ঐতিহাসিক দৃষ্টিকোণ থেকে দেখা হয় এগুলোর সমাধান করার জন্য এই তত্ত্বে অনেক পরিবর্তন আনা হয়েছে আবার মাঝেমাঝে উন্নততর পর্যবেক্ষণ করা হয়েছে',
    'কিছু গুরুত্বপূর্ণ সমস্যা এবং তৎসংশ্লিষ্ট অন্যান্য বিষয় এখানে ব্যাখ্যা করা হল',
    'সাধারণভাবে মহাবিশ্বের তিন ধরণের জ্যামিতি থাকতে পারে অধিবৃত্তীয় জ্যামিতি ইউক্লিডীয় জ্যামিতি অথবা উপবৃত্তীয় জ্যামিতি',
    'এই শর্তগুলোতে বলা হয়েছে মহাবিশ্বে সেই বেরিয়ন সংখ্যা থাকতে হবে যা সংরক্ষিত নয় সিপ্রতিসাম্য এবং সিপিপ্রতিসাম্য লংঘন করতে হবে এবং মহাবিশ্বকে তাপগতীয় সাম্যাবস্থা থেকে দূরে থাকতে হবে',
    'অবশ্য বর্তমানেও সন্দেহ রয়েছে যে স্তবকগুলোর বয়স আসলেই সঠিকভাবে নির্ণয় করা হয়েছে কিনা',
    'এই সমস্যা নিরসনের জন্য অদৃশ্য বস্তুর কল্পনা করা ছাড়া গত্যন্তর নেই',
    '১৯৯০এর দশকে মহাবিশ্বের মোট ভর ঘনত্বের একটি বিস্তৃত পরিসংখ্যান প্রকাশিত হয়',
    'তবে এ বিষয়টি বোঝার জন্য বর্তমানেও গবেষণা এগিয়ে চলছে',
    'মহাবিশ্বের এনট্রপি বাড়তে বাড়তে এমন একটি বিন্দুতে পৌঁছাবে যখন এ থেকে কোন সুসংগঠিত শক্তি পাওয়া যাবে না',
    'মহাবিশ্বের সম্প্রসারণের একটি চিত্রলৈখিক উপস্থাপন',
    'হার্টলহকিং সীমান্তবর্তী শর্ত সহ এ ধরণের অন্য সব নকশা যেগুলোতে স্থানকালকে সসীম ধরা হয়েছে',
    'আবার অনেকেই পেয়েছেন অমিল',
    'পোপ পিয়ান ১২ মহা বিস্ফোরণ তত্ত্বের ভালো সমর্থক ছিলেন যদিও তখনও এই তত্ত্ব বৈজ্ঞানিকভাবে সম্পূর্ণ প্রমাণিত হয় নি',
    'হিন্দু ধর্মের কিছু অস্তিবাদী অংশ যেমন বৈষ্ণব ধর্ম মহা বিস্ফোরণের ধারণাকে সমর্থন করে',
    'মহাজাগতিক দিগন্ত',
    'গীতাঞ্জলি কাব্যগ্রন্থের জন্য ১৯১৩ সালে সাহিত্যে নোবেল পুরস্কার লাভ করেন তিনি',
    'তাঁর বহুপরিচিত গ্রন্থগুলির অন্যতম হল গীতাঞ্জলি গোরা ঘরে বাইরে রক্তকরবী শেষের কবিতা ইত্যাদি',
    'ফলে অত্যন্ত ধনাঢ্য ও সম্ভ্রান্ত পরিবারের সন্তান হয়েও রবীন্দ্রনাথ কার্যত এক ভৃত্যরাজক তন্ত্রে প্রতিপালিত হন',
    '১৮৭৭ সালে মাত্র ষোলো বছর বয়সে তাঁর কয়েকটি গুরুত্বপূর্ণ রচনা প্রকাশিত হয় ভারতী পত্রিকায়',
    'ব্যারিস্টার হওয়ার উদ্দেশ্যে ১৮৭৮ সালে ইংল্যান্ডে পাড়ি দেন রবীন্দ্রনাথ',
    '১৮৮৩ সালের ৯ ডিসেম্বর ঠাকুরবাড়ির এক অধস্তন কর্মচারীর কন্যা ভবতারিণীর সঙ্গে তাঁর বিবাহ হয়',
    'এছাড়াও কুড়ি থেকে ত্রিশ বছর বয়সের মধ্যে প্রকাশিত হয় তাঁর আরও কয়েকটি প্রসিদ্ধ কাব্যগ্রন্থ',
    '১৯০২ সালের ২৩ নভেম্বর কবিপত্নী মৃণালিনী দেবী প্রয়াত হলেন ১৯০৩ সালের ১৯ সেপ্টেম্বর মারা গেলেন কন্যা রেণুকা ১৯০৫ সালের ১৯ জানুয়ারি পিতৃবিয়োগ হল কবির',
    'গদ্য ছন্দে নিজের কবিতার ইংরেজি অনুবাদও করতে শুরু করেছেন রবীন্দ্রনাথ',
    '১৯৩০এর দশকের প্রথম ভাগে রবীন্দ্রনাথ ভারতের অযৌক্তিক বর্ণাশ্রম সচেতনতা ও অস্পৃশ্যতার তীব্র সমালোচনা করেন',
    'গদ্যছন্দে রচিত একটি শতপংক্তির কবিতায় তিনি এই ঘটনা চিত্রায়িত করেন',
    'বৈজ্ঞানিক ক্রিয়াকলাপকেও সূত্রবদ্ধ করেন রবীন্দ্রনাথ',
    'এই সময়কালের মধ্যেই জীবনের শ্রেষ্ঠ কিছু কবিতা রচনা করেন রবীন্দ্রনাথ',
    '১৯৩৪ এ শ্রীলংকা সিংহল ভ্রমণ শেষে কবি শান্তিনিকেতনে ফেরেন ২৮ জুন',
    'লন্ডনে মিশনারি তথা গান্ধীবাদী চার্লস এফ অ্যান্ড্রুজ অ্যাংলোআইরিশ কবি উইলিয়াম বাটলার ইয়েটস এজরা পাউন্ড রবার্ট ব্রিজেস আর্নেস্ট রাইস টমাস স্টার্জ মুর প্রমুখ বিশিষ্ট ব্যক্তিবর্গ তাঁর গুণমুগ্ধে পরিণত হন',
    'রোমা রোঁলা প্রমুখ বিশ্বশান্তিবাদীরা এই প্রবন্ধের ভূয়সী প্রশংসা করেন',
    'প্রথম দিকে উভয়ের মধ্যে উষ্ণ সম্পর্ক থাকলেও ১৯২৬ সালের ২০ জুলাই প্রথম মুসোলিনির বিরুদ্ধে বক্তব্য রাখেন রবীন্দ্রনাথ',
    'বার্মিংহামে বসেই তিনি অক্সফোর্ড বিশ্ববিদ্যালয়ে প্রদানের জন্য তাঁর হিবার্ট বক্তৃতামালা রচনা করেন',
    '১৯৩২ সালের এপ্রিলে জীবনের শেষপর্বে তিনি তাই যান ইরানে',
    'রবীন্দ্রনাথ তাঁর কবিতাগুলির জন্য সর্বাধিক পরিচিত',
    'এই কাব্যগুলির উৎস পঞ্চদশ ও ষোড়শ শতকে রচিত বৈষ্ণব কবিদের পদাবলি সাহিত্য',
    'প্রকৃতি ও মানবচরিত্রের আবেগময় নাটকীয়তার মধ্য দিয়ে এই যোগসূত্রটি পরমসত্ত্বার সঙ্গে মিলিত হয়েছে',
    'এই কাব্যগ্রন্থটির জন্যই তিনি নোবেল পুরস্কার লাভ করেছিলেন',
    'আবার কখনও মনস্তাত্ত্বিক দ্বন্দ্বের বৌদ্ধিক বিশ্লেষণকে করে তুলেছেন গল্পের মূল উপজীব্য',
    'একটা বিদেশের নাম শুনিলেই অমনি আমার চিত্ত ছুটিয়া যায় তেমনি বিদেশী লোক দেখিলেই অমনি নদী পর্বত অরণ্যের মধ্যে একটা কুটিরের দৃশ্য মনে উদয় হয় এবং একটা উল্লাসপূর্ণ স্বাধীন জীবনযাত্রার কথা কল্পনায় জাগিয়া ওঠে',
    'কিন্তু বিয়ের আগের রাতেই আবার পালিয়ে যায় তারাপদ',
    'মুসলমানীর গল্প নামক গল্পটিতে হিন্দুমুসলমান বিরোধের মূল কারণগুলি অনুসন্ধান করেছেন রবীন্দ্রনাথ',
    'ঘরেবাইরে উপন্যাসে রবীন্দ্রনাথ ভারতীয় জাতীয়তাবাদের উত্থান চরমপন্থী আন্দোলন স্বদেশী আন্দোলনের ধর্মীয় অনুষঙ্গ ইত্যাদির বিরোধিতা করেন',
    'একই সঙ্গে বাংলার ভূমিকেন্দ্রিক সামন্ততন্ত্রের পতনের পূর্বাভাষও মেলে এই উপন্যাস থেকে',
    'একটি অনুষ্ঠানে রবীন্দ্রনাথের কবিতা পাঠ করছেন বিশিষ্ট অভিনেতা সৌমিত্র চট্টোপাধ্যায় রবীন্দ্রনাথের উপন্যাস ও গল্প অবলম্বনে নির্মিত বহু চলচ্চিত্রে নায়কের ভূমিকায় অভিনয় করেছিলেন সৌমিত্র',
    'এই সব ভ্রমণের বৃত্তান্ত লিপিবদ্ধ রয়েছে য়ুরোপ প্রবাসীর পত্র ১৮৮১ য়ুরোপ যাত্রীর ডায়েরি ১৮৯২৯৩ জাপান যাত্রী ১৯১৯ যাত্রী ১৯১৯ রাশিয়ার চিঠি ১৯১৩ পারস্যে ১৯৩৬ ইত্যাদি গ্রন্থে',
    'এই নাটকটি সারা বিশ্বে জনপ্রিয়তা অর্জন করে',
    'এই নাটকের বৈশিষ্ট্য ছিল এক জটিল উপকাহিনির জালিকা এবং বিস্তারিত স্বগতোক্তি',
    'রবীন্দ্রনাথ ছিলেন একজন স্বনামধন্য সংগীতস্রষ্টা ও বিশিষ্ট চিত্রকর',
    'ইন্দিরা দেবী চৌধুরাণী প্রদত্ত একটি তালিকা অনুসারে রবীন্দ্রনাথের ভাঙা গান অর্থাৎ অপরের সংগীত থেকে অনুপ্রাণিত হয়ে রচিত গানের সংখ্যা ২৩৪',
    'উত্তর নিউজিল্যান্ডের একটি মালাগান মুখোশের প্যাস্টেলবর্ণ চিত্র রবীন্দ্রনাথ এই ছবিতে আদিমতাবাদের শৌখিন চর্চা করেছেন',
    'মুখাবয়ব বা মুখমণ্ডল আঁকার প্রতি তাঁর বিশেষ পক্ষপাত ছিল',
    'কবিতা ও গানের আঙ্গিকে রবীন্দ্রনাথ যে কথা বলতে পারেন নি সেই অসৌন্দর্য কিম্ভূত আর অসুরেরই প্রকাশ তাঁর চিত্রকলা',
    'শান্তিনিকেতনে রবীন্দ্রনাথের আতিথেয়তায় মহাত্মা গান্ধী ও তাঁর পত্নী কস্তুরবা গান্ধী ১৯৪০',
    'এই ধরনের মতবাদ অনেককেই বিক্ষুব্ধ করে তুলেছিল',
    'রবীন্দ্রনাথের তোতাকাহিনী গল্পের উপজীব্য একটি খাঁচায় আবদ্ধ পাখি',
    'নোবেল পুরস্কারের অর্থমূল্য হিসেবে প্রাপ্ত সম্পূর্ণ অর্থ তিনি ঢেলে দেন এই বিদ্যালয়ের পরিচালনে',
    'ভাষা শিল্পকলা ইতিহাস এমনকি রাজনীতি বাংলার সংস্কৃতির সকল অঙ্গনে রবীন্দ্রনাথের প্রভাব অনস্বীকার্য',
    'চেক ভারততত্ত্ববিদ ভিনসেন্স লেনসি একাধিক ইউরোপীয় তাঁর গ্রন্থ অনুবাদ করেন',
    'রবীন্দ্রনাথের মূল বাংলা কবিতা যাঁরা পড়েননি এমন বহু পাশ্চাত্য সাহিত্যিক ও সাহিত্য সমালোচক রবীন্দ্রনাথের গুরুত্ব অস্বীকারও করেছিলেন',
    'বহিঃসংযোগ',
    'রচনাবলি',
    'বিষয়শ্রেণীরোম্যান্টিক কবি',
    'তাজ মহল সাম্প্রতি যে হুমকির মুখে পরেছে তা হল যমুনা নদীর তীরের পরিবেশ দূষণ',
    'রূপকথা',
    'তথ্য জ্যামিতি',
    'তথ্যবাদ',
    'সাইবারনেটিক্\u200cস',
    'তথ্যের দর্শন',
    'বহিঃসংযোগ',
    'স্তন্যপায়ী প্রাণীর শরীরে স্বেদগ্রন্থি বিবর্তন লাভ করে স্তনে রূপান্তরিত হয়',
    'বহুকোষী ছত্রাক',
    'জীবানু অস্ত্র',
    'জার্মানি জার্মান ভাষায় Deutschland ডয়চ্\u200cলান্ট্\u200c আধ্বব dɔʏtʃlant মধ্য ইউরোপের একটি রাষ্ট্র',
    'জার্মানিতে নগরায়নের হার অত্যন্ত উঁচু',
    'এটির অর্থনীতি মার্কিন যুক্তরাষ্ট্র ও জাপানের পরে বিশ্বের ৩য় বৃহত্তম',
    'এই ঘটনাটিকে পূর্ব ইউরোপে সাম্যবাদের পতন ও জার্মানির পুনঃএকত্রীকরণের প্রতীক হিসেবে গণ্য করা হয়',
    'প্রত্নতাত্ত্বিক গবেষণায় এই তথ্যগুলোর অনেকাংশই উদ্\u200cঘাটিত হয়েছে',
    'রাষ্ট্র ও অঞ্চলসমূহ',
    '১৯শ শতকের শুরুতে ফ্রান্স জার্মান রাষ্ট্রগুলি দখল করলে জাতিগতভাবে একত্রিত এক জার্মানির জন্য জনমত প্রবল হয় এবং ১৮১৫ সালে প্রুশিয়ার নেতৃত্বে জার্মান রাষ্ট্রগুলি একটি কনফেডারেশন গঠন করে যা ১৮৬৭ সাল পর্যন্ত স্থায়ী ছিল',
    'পশ্চিমনিয়ন্ত্রিত বাকী তিন অঞ্চল একত্রিত হয়ে পশ্চিম জার্মানি গঠন করে',
    'জার্মানির রাষ্ট্রপ্রধান হল রাষ্ট্রপতি যিনি বুনডেসটাগ Bundestag ও প্রত্যেক রাষ্ট্রের সমসংখ্যক প্রতিনিধি নিয়ে গঠিত সম্মিলিত সভার দ্বারা নির্বাচিত হন',
    'আয়তনের বিচারে জার্মানি ইউরোপের মধ্যে সপ্তম এবং বিশ্বের মধ্যে ৬৩তম',
    'প্রাকৃতিক দুর্যোগের মধ্যে বন্যা ও ঝড়ো বাতাস প্রায় সকল অঞ্চলে দেখা যায়',
    'সামরিক বাহিনী',
    'এ পর্যন্ত দুই জন মহিলা চিকিৎসা কর্মকর্তাকে জেনারেল পদমর্যাদায় উন্নীত করা হয়েছে',
    'আরও দেখুন',
    'সৌধটি নির্মাণ শুরু হয়েছিল ১৬৩২ খ্রিস্টাব্দে যা সম্পূর্ণ হয়েছিল প্রায় ১৬৪৮ খ্রিস্টাব্দে',
    'তাজ মহলের নির্মাণ কাজ মুমতাজের মৃত্যুর খুব শীঘ্রই শুরু হয়',
    'বাগান',
    'প্রায় সব মুঘল চারবাগসমূহ চতুর্ভুজাকৃতির যার বাগানের মধ্যখানে মাজার বা শিবির থাকে',
    'নদীর দিকের পাশটিতে কোন দেয়াল নাই',
    'জাওয়াবের ভিতরের নকশা',
    'ইমারতটির নির্মান সম্পূর্ণ হয়েছিল ১৬৪৩ খ্রিস্টাব্দে',
    'ভিত্তিটি আদতে একটি কোণ গুলো ভাঙ্গা ঘনক্ষেত্র প্রতিদিকে প্রায় ৫৫ মিটার ডানে মেঝের পরিকল্পনা দেখুন',
    'এর আকার প্রায় ইমারতের ভিত্তির আকারের সমান যা প্রায় ৩৫ মিটার',
    'লম্বা মোচাকার চূড়া বা গুলদাস্তা ভিত্তি দেয়ালের পাশ দিয়ে উপরে উঠেছ এবং গম্বুজের উচ্চতায় দৃষ্টগোচড় হয়',
    'মিনারগুলোতেও তাজ মহলের প্রতিসমতার ব্যাপারটিই লক্ষ করা যায়',
    'তাজ মহলের মেঝের বিন্যাস',
    'একই গভীরতায় আরও একটি কুয়া খনন করা হয়েছিল সময়ের সাথে সাথে পানির স্তর পরিমাপ করার জন্য',
    'সমাধি',
    'পানি নদী থেকে উঠানো হতো কয়েকটি পুর দিয়ে দড়ি ও বালটির মাধ্যমে পানি পশু দ্বারা টেনে তোলার এক পদ্ধতি',
    'পুরগুলো এখন আর অবশিস্ট নেই কিন্তু অবকাঠামোর অন্যান্য অংশ এখনো আগের মতই আছে',
    'পারস্যের সিরাজ ইরান আমানত খাঁন যিনি প্রধান চারুলিপিকর তার নাম তাজ মহলের প্রবেশপথের দরজায় প্রত্যায়িত করা আছে সেখানে তার নাম পাথরে খোদাই করে লেখা আছে',
    'এ ধরণের আটাশ ধরনের মূল্যবাদ এবং মহামূল্যবান পাথর সাদা মার্বেল পাথরেরে উপর বসানো রয়েছে',
    '১৯ শতকের শেষ ভাগে তাজ মহলের একটি অংশ মেরামতের অভাবে খুব খারাপ ভাবে নষ্ট হয়',
    'নোবেল ফাউন্ডেশন তাঁর এই কাব্যগ্রন্থটিকে বর্ণনা করেছিল একটি গভীরভাবে সংবেদনশীল উজ্জ্বল ও সুন্দর কাব্যগ্রন্থ রূপে',
    'রবীন্দ্রনাথের কাব্য ছোটোগল্প ও উপন্যাস গীতিধর্মিতা সহজবোধ্যতা ধ্যানগম্ভীর প্রকৃতিবাদ ও দার্শনিক চিন্তাধারার জন্য প্রসিদ্ধ'
];

englishTexts = [
    'In this due to misunderstanding frustrated Mussolini on 28th October 1940 attacked Greece from Albania',
    'In the same day of 6th April Germany attacked Greece and Yugoslavia by bombarding from the air and by sending armies through Bulgaria and Austria',
    'As per the theory of the Big Bang the universe was created from a highly dense drop',
    'The explanation about the structure of the ancientest objects of the universe can be derived through this for which the AlpherBetheGamow theory was propounded just after the theory of Big Bang',
    'himaliya also is between two borders',
    'There are two different possibilities',
    'apart from these two sketches of howel and laymetrer several more sketches were presented of the universe',
    'Presently people have powerful telescope like Kobe Hubble space telescope and WMAP',
    'Laws of physics became applicable after 1043 seconds of formation of the universe',
    'That is there occurs a small excess of quarks and leptons over antiquarks and antileptons',
    'Simultaneously annihilation of mass starts within the remaining proton and antiproton',
    'Almost 380 000 years after the Big Bang the electron and the nucleus united to form atoms among these mainly hydrogen atoms were formed',
    'from the satellite wmp some evidences show that the amount of invisible cold substances is maximum about 80',
    'It can be said that lots of observation and research on both theoretical and practical field of relation between equation of state of this energy and structure of conventional particle physics have still to be done',
    'At present compiling a modernage theory to understand this subject is the biggest unsolved problem in physics',
    'Even if the comoving distance and the coordinate distance are same of any two points in the space the physical distance of these comoving points increases proportionally with the scale factor of the universe',
    'So that we would never be able to see the whole part of the old universe',
    'These are Hubbletype expansion accepted after observing the red shift of galaxiesthe comprehensive measurement of the cosmic microwave background and abundance of light elements',
    'This observation is recognized as the basic foundation of the theory of great explosion till today',
    'Nucleon and electron united and formed atom',
    'This discovery stands in favor of the Big Bang hypothesis and brought Arno Penzias and Robert Wilson the Nobel Prize',
    'Abundance of these elements mainly depends on the ratio of photons and baryons',
    'Miraculously it is seen that in the new Universe the Helium content is more than the Deuterium or Helium 3He is smaller than the Deuterium and its always keeps its ratio constant',
    'Though almost most all the researchers now agree with the theory of the Big Bang it was not like this at one time',
    'For the solution of this a independent experiment with Big Bang and by releasing main stream of light and then studying it and study with the most new stars',
    'Equation problem',
    'But now it has been proved through observation that almost whole of the observable universe is made up of matter',
    'A literary genre is a category of literary composition Genres may be determined by technique tone content or length Nancy Anderson associate professor in the College of Education at the University of South Florida in Tampa',
    'After that the scientists had to accept the idea that 90 of the universe is not normal baryonic matter but they are Dark matter',
    'Because the gravitational effects of these matters are not exactly understood',
    'From this only came the thought of invisible power',
    'On the other hand if the density is equal to or less than the critical density at some point of time the expansion will slow down but will never come to an end',
    'It is said in this theory that only the gravitationally limited objects of the universe such as galaxy will stay together However heat death of them will happen as well due to expansion and freezing of the universe',
    'Form the inflation index we assume that the indexing expansion has made the whole universe has moved out from the scope of observation',
    'But the basic principles of it have not yet been clearly proved',
    'A result for various information regarding the Big Bang Theory is given over here',
    'The Ayat that worth mention in this regard is Shura Ambia 2130',
    'In popular Gen Culture variation in Universe is accepted',
    'This measurement is being made by observing the reaction between the galaxy clusters and super clusters and CMB',
    'see more',
    'And for these reason only it was said that if the stability theory is accepted then the earth must be taken as an absolute plain',
    'Information helping in experiment',
    'In mathematics a complex number is regarded as a mathematical extension of a real number',
    'Complex numbers were first conceived by the Italian mathematician Gerolamo Cardano during his attempts to find solutions to cubic equations',
    'Like Complex Analysis Complex matrix Complex polynomial and Complex Lie algebra',
    'The complex numbers of which the real part is zero are called imaginary numbers and instead of that they are denoted only by',
    'Operation',
    'From here it is clearly seen that',
    'Just it is known that',
    'Now we notice that',
    'Where either the value of c and d is not equal to zero',
    'When every real numbers a is expressed as a+0i R the field of real numbers constitutes a sub field of complex field C',
    'One complex numbers modulus value can be calculated this way',
    'If and only if z is only imaginary ie the real part of z is zero',
    'Where the solutions of the equation represent the points on sides of those 17 sided polygon',
    'Then this argument is called the principal argument',
    'Polar Form is generally revealed',
    'From there we can get',
    'If C=0 then nth root will be only zero',
    'Introduction of ambiguity',
    'After that she gets introduced with negative number during learning of algebra',
    'chinese currencies also are in majority which are written in modern language which is chinese word and han hopenion which is freom roman words tibetin which is from tibbati words yugor with arabic words mangolian traditionally with mangolian words are written',
    'At the beginning of learning algebra like a student ask wat is the meaning of this equation',
    'Literally',
    'Real and imaginary is two meaning full word when complex number is represented as only a real number',
    'If all the poles of a system',
    'Where z is the representation of Sine wave in complex number',
    'where Fourier Analysis and wavelet analysis are used to signal transmit compress and restore',
    'Equation related to special relativity and general relativity become more easy when time is represented by imaginary numberthere is not much use in Classical Relativity but it has more use in quantum Field Theory ',
    'Sources',
    'Cumulative rule',
    'topological closure',
    'Pakistan Urdu پاکِستان officially the Islamic Republic of Pakistan Urdu اسلامی جمہوریہ پاکِستان is a country in South Asia',
    'Afterwards it came under the British Empire',
    'SSindh',
    'References',
    'History',
    'References',
    'Main characteristics',
    'It is true that most of the open source softwares are developed by the volunteers but there are exceptions to it',
    'Later Italy joined with German ',
    'In this war almost 62000000 people died more than half of them were Russian',
    'This deadliest weapon was invented during turmoil of the war and the war came to an end with the application of this very weapon itself',
    'This reason became the basis understanding among the countries of Allied force during the postwar time through the policy of conciliation in which the directory role was played by United States and France',
    'Germany made a nonaggression treaty with the Soviet Union with a view to keep Soviet inactive',
    'Last army force fought till 6th October in Kock Castle',
    'As a consequence the fate of the war was clear',
    'On the other hand the friendly side made a plan to plant mines in the sea just outside the Nervik',
    'But by that time the Allied troops were evacuated as France was facing some catastrophic situations',
    'BEF british expiditionary force and France forcestarted retreat under the Dankakar port',
    'Germany took hold of most of the areas in France',
    'But the Greek not only fought with them infact within December they captured onethird part of Albania',
    'Greece and Bulgaria surrendered respectively on 17th and 22nd April',
    'This universe was formed out of a highly dense and hot state before 137 billion year from now',
    'An important consequence of the big bang is that the present state of the universe is completely different from its past and future states',
    'which is protecting them from being safe and to be ready to see all the activities of the enemies from one place to another place',
    'One is the static state hypothesis by Fred Hoyle which states that when the universe starts expanding then new matters may start forming here',
    'those which are to be mentioned significantly are milne modeltrembling universing presented by richard tallman and weak light presented by firkas zuiki',
    'Therefore present astronauts can easily measure different parameters of Big Bang',
    'So this period is called Planck time',
    'Its rate is one in every 1010',
    'So antiproton completely exhausts and proton almost exhaust',
    'Following this the energy released from the matters spreads all over the universe as radiations because it does not have to face ant significant obstacles',
    'other two type constitute about 20',
    'All these observations are made connected by universal lambdaCDMA equation',
    'The basic foundation of the theory',
    'If we explain the universe with these coordinates we would find that the big bang was not meant for filling up the hollow spaces of the universe rather the space is itself expanding and consequently the physical distances of the comoving points have been increased',
    'From this that the idea of horizon of the past was originated',
    'On top of that the observational correlation function which is involved in the creation of the vast extent of the universegoes well with the ideal theory of Big Bang',
    'This proposal was made by FredmanLemaitroRobertsonWalker',
    'At the same time the early age plasmas converted into a inactive gas',
    'In 1989 NASA sent a satellite named Cosmic Background Explorer satellite COBE to explore the background radiation',
    'The ratios with regard to mass that were expected in this model are as follows',
    'Milky Way path',
    'Then most of them would believe in alternative model of the universe',
    'The problems are much lessened now by experimenting on the gravitation and with information',
    'The full geometry of the universe is determined on the bais of whether it is more or lesser than Omega Cosmological Scale 1',
    'In its solution it has been stated that this asymmetry was created by an unknown process called baryogenesis',
    'A muchoverlooked kind of childrens literature is work written by children and young teens such as The Young Visiters by Daisy Ashford aged nine',
    'Before that the thinking was that all matters in the universe are normal which we can see and observe',
    'Till today the direct observation of the dark matters has not yet been possible from any of the observatories of the world',
    'It is thought that the remaining 70 of this strength is made by it',
    'The more the universe will expand its density will decrease and as a result of which no new starts will form',
    'Another theory is Phantom Power theory',
    'We can have detailed knowledge of what has happened during that time when we will understand the heavy powered physics theories',
    'Philosophical and religious explanation',
    'Christian religion',
    'Even the eminent Islamic thinkers have reckoned that the issue of an expanding universe has been mentioned in the Quran Shura AjYariat 2147',
    'Look More',
    'To observe this reaction SunyaevZeldovich effect is being considered',
    'recessioanal velocity also roams around it',
    'Magnetic monopole',
    'Subject Astronomical Physical Science',
    'The complex number is derived by attaching the imaginary unit to a real number',
    'He defied them as fictitious',
    'Definition',
    'Now if is and then instead of writing only the number is written',
    'As the roll wise of the real number',
    'If we name the cumulative pair as Z then it can be written',
    'If the imaginary part of two complex number become zero then this is also called as the operation of two real number',
    'ie from where this formula is produced',
    'Field of Complex number',
    'The set of all complex numbers can be shown as topomathematical boundary of algebraic variables or algebraic boundaries of R',
    'Modulus three main properties are',
    'If z is nonzero',
    'Polar form',
    'In this way if a complex number is expressed with its polar coordinate then we call it a polar form',
    'Size',
    'Addition of two complex number is like the addition of two vector in the vector space',
    'Where as nth root multiplicity of 0 is take as n',
    'Ambiguity concerning complex numbers starts from the nomenclature itself',
    'She views that number with suspicion at first',
    'after the cultural revolution and othe policies the people democracy chinas main land 69 means 767 population speak ladin to them selves',
    'Why we should add a with b',
    'One common mis conception',
    'Where real part use to represent the real world',
    'are on the right half plane then it is unstable',
    'In Fourier analysis to represent any signal which is represented as a function of real numbers as a collection of many periodical functions complex number function is used',
    'Improper Integral',
    'To use this theory use complex number is mustIt is a simple form of equation',
    'Mathematical Sources',
    'Distributive rule',
    'Algebraic closure',
    'It is located in a position between the important regions of South Asia Central Asia and the Middle East',
    'During the month of August of 1947 the region got its independence as the Western part of the state of Pakistan',
    'TanBaluchistan',
    'See also',
    'Wikimedia Foundation San Francisco',
    'Current members of trusty board',
    'External links',
    'Free distribution rights meaning copy sell etc',
    'In fact the source of revenue in open source software business is not the sales price but the money earned from the service provided for the software',
    'From German captured country Army was sent against German',
    'Main reason of this was some ordinary people killing mission',
    'If we set all reconstruction costs aside the total amount of expenditure was 1 trillion US dollars in 1945 alone',
    'This reason got established making responsible the domination and imperialism of Germany and Japan after the World War I whose details is mentioned here',
    'On the other hand Britain and France made a treaty of cooperation with Poland',
    'Soviet Finland war',
    'Finland applied for a peace agreement on 6th March 1940',
    'When the plan was revealed then Hitler stopped his will of capturing France and ordered to make their journey to Norway',
    'Norway troops surrendered to Germany and King Haakon went to Britain',
    'On 26the may 4th june historic dismissal of the soldier came to an end',
    'Pentta formed a government with few areas which was neutral but free from the influence of Germany',
    'Above it British army came down to Crete',
    'After that Crete was occupied',
    'First generation server of Google was made of cheap computers which are available in the market',
    'This proposition is known as the theory of Big Bang in the physical theology of the universe',
    'Through this theory that George Gamow could imagine in 1948 about the existence of the cosmic microwave background radiation',
    'in any way this can be calrifi',
    'According to this hypothesis at universe remains the same at any point of time',
    'for a temporariry period both the static state and bing bang was admired by all but there were lot to be argumented as well',
    'For this reason there is an unexpected discovery and it is proof of increase expansion of expanding universe see dark energy',
    'After about 1035 seconds of Planck time began a phase of change in the state that is a state of transition as a result of which the universe started inflating',
    'This process is called Baryogenesis',
    'But some proton still remain',
    'This old radiation is called as the small wave radiation',
    'some suspicious power exists in present universe',
    'This equation which is made up by extracting all the equations is mainly mathematical which has six free parameters',
    'The big bang theory depends on the following assumptions',
    'The matters those are unified like atoms men stars solar system galaxies they dont expand to move apart from each others as the time and space expand because the force that has kept them unified is stronger than the force responsible for the Hubble Expansion',
    'If this universe is spreading with acceleration then a definite amount of conformal time is there for the future',
    'Hubbles Law',
    'The background of universal small ripple diffusion',
    'The name of this process is Photon Decoupling',
    'The data sent by this satellite in 1990 supported the Big Bang theory',
    '025 for 8 HeH',
    'With keen description it is seen that Milky Way and Coasar and the expanded path system supports the Big Bang Theory',
    'With these there have been formed the Nonstandard Cosmology',
    'But this information are not properly included in the Physical Science till now',
    'From top to bottom Geometry of a closed universe an open universe and a flat universe',
    'Sakharov conditions must be fulfilled for baryogenesis to occur',
    'or the juvenilia of Jane Austen written to amuse brothers and sisters Anne Frank wrote a novel and many short stories in addition to her diary',
    'But this idea was strongly inconsistent with observations',
    'The dark matters are the subjects of many significant researches of particle physics',
    'Its nature is the most uncertain topic according to the Big Bang Theory',
    'The average temperature of the universe will asymptotically approach the absolute zero and big freeze condition will be created',
    'According to this cluster of galaxies stars planets atoms or subatomic particles everything will be torn apart and due to this bigrip will be created in the ever expanding universe in a particular time',
    'Every assumption in this respect is treated as quantum physics',
    'The Big Bang is a scientific theory it is not propounded on the basis of any religion',
    'A lot of Christians and the traditional Jews believe on the basis of some facts and data that the Big Bang could be a probable reason of the creation of the universe',
    'The theories of great contraction and vibrating universe are also included in Quran Shura Ambia 21104',
    'Written times of Universe',
    'In this case 1 purity is assumed to be found',
    'for sake',
    'On the end of the decades of 1970 the magnetic mono polarization thought first came into existence',
    'Subject Physical information on Earth',
    ' is defined by following equation',
    'The solution of a general cubic equation in radicals may require intermediate calculations containing the square roots of negative numbers even when the final solutions are real numbers',
    'Signal method',
    'In some cases especially in different faculties of Electrical Engineering where with electric current in a circuit is denoted the imaginary unit is expressed by this instead of ',
    'Complex number can be written as the roll number of a real number where the number is a point in the complex field where x and y are the two poles',
    'Where',
    'And because of this',
    'Though the multiplicative operation is not like the operation in which the positive number is placed on the negative number and then arranged',
    'One field obey the rule of algebraic operation of additionsubtractionmultiplication and division',
    'Both are explained bellow',
    'Where it may happen and only happens',
    'The last law is used the most when z is given in the Cartesian coordinate',
    'The Cartesian representation of z = x + jy is also expressed through the Polar form',
    'The conversion into the Cartesian form from the polar form',
    'This is called as a form of Triginometry Sometimes cis fie is used to denote cos fie + i sin fie Then Z = r cis fie',
    'Multiplication of complex number can be shown that it is like a rotation and stretching',
    'The ideas regarding complex numbers are not clear and are not transparent',
    'Be in English or in Bengali the term used for these numbers are imaginary unreal and above all complex number',
    'Because it is not easy to create a real example of this number',
    'but religions and customs also play an important role in people democracu specially budhism confisious and tao azm are in them',
    'Is a and b can be a number',
    'When we consider an imaginary unit for the complex numbers we can easily arrive at an equation',
    'After invention of quantum physics it was observed that there is not much change in real number',
    'if on the left half plane then stable',
    'In this case utilized periodical functions are',
    'Often in applied mathematics to calculate the improper integral of real number functions of complex number are used',
    'Result of mathematics',
    'Historical Sources',
    'Algebraic structure',
    'external connections',
    'Pakistan is a part of Indian Subcontinent',
    'The other part of the country ie the East Pakistan was about 1600 kilometers away from Pakistan',
    'In year 1934 writer Choudhuri Rahamat Ali tell this in his book Now or Never',
    'External links',
    'Wikimedia Foundation is an international nonprofit organization',
    'Advisors',
    'Wikimedia Foundation Website',
    'Open source code',
    'Software service means customization of the software development selling instruction manual and providing training etc',
    'Mainly army from Eastern country joined with German and army from other country was against German',
    'Example',
    'Right after this war Europe was divided into two parts one part was the West Europe and Soviet Russia was included in the other part',
    'After the World War I Germany lost almost all her resource dignity and power',
    'The attack on Poland was started on 1st September',
    'During the war with German Soviet Union attacked Finland ',
    'Though they were able to preserve their sovereignty they had to leave a significant amount of their lands near Leningrad to Soviet Union according to their earlier negotiation',
    'On 9th April together Norway and the relation between Denmark and Norway started to advance',
    'For Germany Norway beside the Arctic Ocean and Britain was utilized as an important naval and air bases',
    'They through out the maximum pain',
    'It was known as Vichy France',
    'Turkish also kept an army reserved',
    'Yugoslavia was separated into pieces and was divided among the Axis Powers',
    'Google Adsense is the largest search engine of Google search web',
    'Scientist Edwin Hubble has said it for the first time that if the velocity of the remotest galaxies are examined we will find that they are moving apart that is the universe is expanding continuously',
    'It was discovered in 1960 and could be able prove the theory of Big Bang by repealing the theory of static state',
    'in order to take the command on himaliya people are asked to live with curious and ceremony',
    'The other one is the Big bang theory of Lemaître which practically was established by George Gamow',
    'but a lot of observations of time dimention were presented which supported the second theory rather than the first one',
    'General discussion',
    'At that time the universe started expanding',
    'As the size of universe increases its temperature falls',
    'Same thing happens in the case of neutronantineutron pair',
    'Along the expansion of the universe the distribution of universe was almost uniform',
    'the main source of energy of universe is this energy also called dark energy',
    'It becomes mysterious state When we look at the early stage of creation of our universe',
    'The universality of physical laws',
    'Here we can produce the term conformal time in that case the timespace metric transforms into a static metric and this metric if multiplied by the total scale factor the basic metric can be attained',
    'This is expressed by ',
    'The main research obtained from the research paper done by Hubble in 1929',
    'The sketch of universal little ripple diffusion as obtained from WMAP',
    'During that period a dormant state was existing in the universe with the combination of impartial atoms and different gaseous matters',
    'The residual temperature found by COBE was of 2736 Kelvin',
    '103 for 2 HeH',
    'By considering all these types of observations it is known that almost after one billion years of big bang the first galaxy and quasar was formed and from then onwards larger structures like galactic structures and superstructures began to be created',
    'A lot of arguments have been initiated in course of time the objective of which was to find out the fittest model in terms of astronomical observations',
    'With the theoretical physical science many solution of the problems are tried to bring out',
    'The equation problem is a problem of observation that is related to the FriedmannLemaîtreRobertsonWalker metric',
    'Andrei Sakharov the scientist presented these conditions',
    'n addition many classic books that were originally intended for adults are now commonly thought of as works for children Mark Twain',
    'The Universe presently contains much less deuterium than it is supposed to be without the Dark matter idea',
    'Dark force',
    'Its near about constant is found by the scalar magnitude of the earth constant and the Quintessence unit that made the earth free space is taken in account',
    'At that time black holes will automatically turn into vapor',
    'Hypothetical Physics Crossing the Barriers of Big Bang',
    'Some hypothesis are as follows',
    'Some persons have identified similarities of this theory with many other doctrines',
    'They made it as the first reason of philosophy',
    'The others',
    'Times of Universe',
    'These authorization when unified with the general theory of relativity of Einstein is understood that time and place is defined as homogenous and isotropic metric',
    'it will not be given in future',
    'According to the great contraction theory it was predicted that in the universe there are many spot errors which can be expressed as much denser magnetic mono polarization than the normal observation',
    'Every complex number can be written in this form where a and b are real numbers',
    'This ultimately led to the fundamental theorem of algebra',
    'A complex number is shown in generalized form where a and b are real numbers and is imaginary unit which follows the formula',
    'So complex number are sometimes found to be written as',
    'In the same way as the real numbers are expressed in a point on the number line ',
    'And',
    'Or this process can be called as the Natural Extension or Natural Process',
    'Due to this notational abuse most of the time we have to rich some wrong conclusion',
    'Complex number formed a field which is represent by C',
    'Complex Plane',
    'Triangular equality',
    'The Geometric definition of operation of complex number',
    'The two relevant Polar coordinates of the z are r = 1',
    'The conversion into the polar form from the Cartesian form',
    'Another nice representation of complex number by Walrus Formula is',
    'Multiplication with i can be shown as the 90 degreen2 radian anti clockwise rotation',
    'How much is the complex number complexrealunrealimaginary',
    'It is quite natural that students become suspicious just from the nomenclature itself',
    'Then at a time probably she learns it from the concept of loan',
    'and many comes in the same category so that is almost impossible to take some actions on that',
    'Like that after hearing the name of complex number they also started thinking about complex imaginary etc',
    'This equation is also one of the reasons why the students feel that complex numbers are complex or unreal',
    'But sometime it become necessary to use complex number to explain a real number',
    'if they remain on the axis at the middle then it is marginally stable',
    'of this form',
    'There are different processes like this',
    'To solve Differential Equation complex number of the equation solved first then that equation is represented as ft=ert then it is solved as a base function',
    'For more information please watch',
    'Additive identity',
    'The country has almost one thousand kilometer long coastline',
    'In 1971 the East Pakistan got isolated from Pakistan and became a new country called The Democratic Republic of Bangladesh',
    'In year 1947 after dividing India two country India and Pakistan born',
    'Category South Asia',
    'Ejaculation is the ejecting of semen from the male reproductory tract as it becomes harder with sexual excitement and is usually accompanied by orgasm',
    'Headquarter of Wikimedia Foundation is in San Francisco city of California United States',
    'Plans of wickimedia',
    'Wikimedia blog',
    'Distribution rights of freely changed and modified version of the main software',
    'Perhaps red hat is the most successful open source company',
    'Soviet Union signed a deal name Nonaggression Treaty with German according to this deal Soviet Union will not attack German',
    'Holocaust',
    'Subsequently this Russian Union were broken to form several small states',
    'The imperialism thought of her was due to the regain of lost economic military and landcentric resource and reappear as a world power',
    'On the 3rd of September the Allied Powers declared war against Germany and the Second World War begun',
    'Before this Soviet army entered into Lithunia Lutvia and Estenia and they attacked Finland on 30 November year 1939 because Finland was not agree to sign on some agreement',
    '70000 out of the total 2 lacs Finnish soldiers died in this battle',
    'And over here along with Nervik Germany soldiers captured the important ports',
    'France Belgium Netherlands Luxembourg',
    'between this time being Belgium came to an end on 27th may',
    'Baltic area',
    'The then impartial Bulgaria and Yugoslavia took turns',
    'But throughout the war the Cetnik party under the leadership of Draza Mihajlovic and the Communist party under the leadership of Joseph Tito continued a guerrilla war fare',
    'Googles target is to avail and arrange all the information of the world and make those accessible to public',
    'It has been explained through the FriedmanLemaitreRobertsonWalker model of the general theory of relativity',
    'History',
    'many things are still visible when nothing is going to be shown',
    'This theopry by Lemaître was named by Hoyle',
    'in the year 1964 post cosmic molecular wave reflection theory was discovered and presented the bing bang theory became most important theory to explain the creation of earth and its gradual adaptation',
    'See also Big Bang calender',
    'Basically from this time exponential expansion of the universe began',
    'During fall of temperature at some point of time transition phase occurs as a result of which symmetrical braking takes place',
    'The incident happens for electron and antielectron or positron in more low temperature',
    'But in this also there were some discrepancies',
    'the 70 density of universe is due to this substance',
    'At that time the energy of the particles was so large that it is very not possible to perform a realistic experiment in present day perspective',
    'Cosmological Principle',
    'The conformal coordinate is quite important',
    'Though this conformal time is extreme infinite in comparison with our clocks and which is called the proper time',
    'Observation of distant galaxies and quasars show that they exhibit the red shiftThe wavelengths of the light emitted by them shift to comparatively longer wavelengths',
    'The theory of great explosion told about the background of the existence of little ripple diffusion',
    'As a result radiation emitted from the matter were free to travel the whole universe without any obstruction',
    'It was also found that out of each 150 portion one portion of CMB is isotropic',
    '104 for 3 HeH',
    'The age of the Milky Ways are increasing slowly and with it is increasing there pathways',
    'Of late these arguments are seen from the historical point of view since the theory of Big Bang has been popular to solve them a lot changes have been made in this theory and every now and then some developed experimentation have also been made',
    'Some important problems and some informative facts are defined here',
    'Generally the universe can have three geometries parabolic geometry Euclidean geometry or elliptical geometry',
    'These conditions state that the universe must contain such number of baryons that is not reserved must violate Csymmetry and CPasymmetry and it must be apart from thermal equilibrium',
    'Many authors work with a preferred artist who illustrates their words others create books together and some illustrators write their own books',
    'There is no other way than accepting the dark matter idea to solve this problem',
    'In the 1990s an extensive figure of the actual mass density of the universe was published',
    'But in order to understand this subject experiments are going on at present also',
    'While increasing entropy of the universe will reach such a point that no organized power can be obtained from it',
    'A graphical presentation of the expansion of universe',
    'The Hutrol Hawking theory and other similar kind of theories has assumed the place and time as limit',
    'Again many have found dissimilarities as well',
    'Pope Miyan 12 was a good supporter of the Big Bang Theory thought this information is never proved scientifically',
    'Some theists of the Hindu religion like Vaishnab religion supports the theory of the Big Bang',
    'Cosmetic areas',
    'Rabindranath received the Nobel Prize for Gitanjali poetry in 1913',
    'Among his most popular books are Geetanjali Song Offerings Gora Ghare Baire Raktakarabi Shesher Kabita etc',
    'Rabindranath was from a very rich a well known family but actually he was grown up by the maids who served the tagore families from years',
    'In 1877 some of his important writing was published in Bharati magazine at the age of sixteen',
    'Rabindranath went to England to become a Barrister',
    'He was later killed by Vasudeva Krishna in a battle',
    'And also another few revised copy of his poetry was published in the age of 20 to 30',
    'On 23rd November 1902 poets wife Mrinalini Devi died Daughter Renuka died on 19th September 1903 and the poets father passed away on 19th September 1905',
    'Rabindranath started to translate his own poem in prose rhythm',
    'In the former half of the 1930s Rabindranath had criticized harshly about the social systems like illogical consciousness of races and untouchability',
    'He portrayed this event through a hundredline poem written in verse style',
    'Rabindranath formulized scientific acitivities as well',
    'In this time span Rabindranath wrote some of his best works',
    'The poet after visiting Srilanka Singhol returned Santiniketan on 28th June',
    'In London missionary and Gandhian Charles F Andrews AngloIrish poet William Butler Yeats Ezra Pound Robert Bridges Ernest Rhys and Thomas Sturge Moore etc famous personalities impressed by him',
    'Roma Rolland and other world pacifist had greatly appreciated this article',
    'Though there was warm rapport earlier between them Rabindranath first criticized against Mussolini on 20th July 1926',
    'He wrote the Hibbert Lectures to be present in Oxford University when he was in Birmingham',
    'in 1932 during last phase of his he went to iran',
    'Rabindranath Tagore is mainly famous for his poem',
    'The source of this poetry is Padabali literacy written by Vaishnava poets in 15th and 16thcentury',
    'The connecting link has met the ultimate truth through the dramatic emotions of nature and human character',
    'He got a Nobel Prize for this book of poetry collections',
    'Again at times he made the knowledgeable analysis of the psychological conflicts as his theme of stories',
    'At the very name of another country my heart would go out to it I would fall to weaving a network of dreams the mountains the glens the forest ',
    'but the night before his marriage tarapada escaped',
    'In the story named Musolmanir galpo Rabindranath tried to find the main reasons for the conflict between the Hindus and Muslims',
    'Rabindranath in his novel GhareBaire protested against rise of Indian Nationalism hardcore movement and religious aspects of Swadeshi movement etc',
    'At the same time this novel had also indicated to the fall of the land basis feudalism in Bengal',
    'In one of the functions prominent actor Shaumitra Chafferjee is reciting the poem of Rabindranath Shaumitra Chatterjee acted in the role of hero in many films made on the basis of the novels and stories of Rabindranath',
    'The descriptions of these travels are written in his books Europe Probashir Potro1881 Europe Jatrir Diary182993 Japan Jatri1919 Jatri1919 Russiar Chithi1913 Paroshshe1936 etc',
    'This drama received popularity throughout the world',
    'This specialty of this play was in a fabrication of complex substories and prolonged soliloquy',
    'Rabindranath was a great composer and was a prolific painter',
    'according to indira devi chaudharani the number of songs of rabindranarth which are influenced from other songs are 234',
    'The pastel paint of a Malanggan mask of North New Zealand Rabindranath has cultivated the possession for primordiality',
    'his paintings mostly contains faces',
    'The words that Rabindranath could not express in the form of songs and poems his paintings are his expressions of those ugliness awkwardness and evil ',
    'mahata ghandi and his wife kasturba gandhi at shantiniketan as guest of rabindranath1940',
    'This kind of view point made many people unhappy',
    'The subject of the story Tota Pakhi written by Rabindranath was a bird shut in a cage',
    'He gave his all money he received as Nobel prize to maintain this school',
    'Language Art History in all parts of Bengali culture Rabindranaths effect is mentionable',
    'Czech Indologist Vincenc Lesný has widely translated multiple books in European language',
    'Many western writer criticize Rabindranaths poetry those who does not read the poetry of Rabindranath and they also denied the importance of Rabindrantha',
    'External Link',
    'Essay',
    'Table of Content Romantic Poet',
    'The threatening that have fallen on Taj Mahal by the pollution of the river Yamuna',
    'Fairy tale',
    'Information geometry',
    'Informations',
    'Cybernetics',
    'Philosophy of information',
    'External link',
    'Sudoriferous sweat glands in mammals are modified into breasts by evolution',
    'Multicellular Fungi',
    'MicrobeWeapon or biological weapons',
    'Germany In German languageDeutschland is a country of middle Europe',
    'Urbanization rate in Germany is very high',
    'Its economy is the third largest in the world after the United States of America and Japan',
    'This event is considered as the sign of the collapse of socialism in East Europe and reunification of Germany',
    'In archaeological researches these facts have largely been explored out',
    'Country and areas',
    'During the beginning of 19th century after France occupied the German countries the public opinion for a united nation of German became strong and in the year 1815 under the leadership of Prussia the German nations formed a confederation which stayed up to 1867',
    'The rest of the tree Westcontrolled regions united to form West Germany',
    'The President Christian Wulff is the head of state and is elected by the Bundestag and an equal number of state delegates',
    'Area wise Germany is the 7th in Europe and 63rd in the world',
    'Out of the natural disasters flood and gusty winds can be seen in almost every region',
    'Military Force',
    'Until now two lady doctors are promoted to the General post',
    'See more',
    'The edifice was started to be built in 1632 and was completed around 1648',
    'The construction of the Taj Mahal was begun soon after Mumtazs death',
    'Garden',
    'Most of the Mughal Charbaghs are rectangular in shape with a Mazar or tomb in the center',
    'construction and modern industries revolution',
    'Interior design of Jawab',
    'the construction of this building was completed in 1643',
    'The foundation is actually a cube with broken edges around 55 meters on each side see the plan of the floor on the right side',
    'Its shape is almost like that of the foundation of the building which is around 35 meters',
    'Tall decorative spires extend from the side of the base walls and give a visual emphasis to the height of the dome',
    'The symmetry matters of Taj Mahal can be observed in these minarets',
    'Floor arraying of the Taj Mahal',
    'Up to the same depth another well was dug to measure the level of water with the elapse of times',
    'Grave',
    'The water was carried up with some pur this was actually a method of pulling up water by animals with an arrangement of ropes and buckets',
    'The full part is not remaining now but other parts of the main structure is remaining same',
    'the name of the main architecht of taj mahal amanat khan who was from siraj iran is written on the stone of the main entry of taj mahal',
    'Like this 28 types of valuable and highly valuable stones are studded on the marble stones',
    'during last phase of 19th century one part of Taj mahal destroyed due to lack of repair',
    'Nobel foundation described this poetry as a deeply impressionable bright and beautiful poetry book',
    'The novels short stories and poetry of Rabindranath are famous for their lyricism easycomprehensibility consecrated naturalism and philosophical thoughts'
];

alignIndexes = []

let bnIdx = 0;
let enIdx = 0;

function fetchInputs() {
    src_inp.value = banglaTexts[bnIdx++]
    tgt_inp.value = englishTexts[enIdx++]

    if (bnIdx === banglaTexts.length || enIdx === englishTexts.length) {
        bnIdx = 0;
        enIdx = 0;
    }
}


function storeAligns() {
    alignIndexes.push(aligns_inp.value);
    alignIndexes.value = "";

    alert("Total " + alignIndexes.length + " Alignment(s) stored!")
}


function saveAsText() {
    var content = "";

    for (var i = 0; i < alignIndexes.length; i++) {
        content += alignIndexes[i];
        content += "\n";
    }

    // Build a data URI:
    uri = "data:application/octet-stream," + encodeURIComponent(content);

    // Click on the file to download
    // You can also do this as a button that has the href pointing to the data URI
    location.href = uri;
}

//=============================================================================

function createAlignsFromStr(align_str) {
    try {
        // Will also throw an error when giving a negative value
        const aligns = align_str.split(" ").map(pair => pair.split("-", 2).map(x => parseInt(x)))

        if (aligns.length < 1) {
            throw TypeError
        }

        for (let align of aligns) {
            if (align.length != 2) {
                throw TypeError
            } else if (Number.isNaN(align)) {
                throw TypeError
            }

            for (let a of align) {
                if (Number.isNaN(a)) {
                    throw TypeError
                }
            }
        }
        errorHandling("")
        return aligns
    } catch (error) {
        errorHandling("Something went wrong when parsing the alignments. Make sure that they are in the correct format and not negative, e.g. 0-0 1-0 2-2")
        return false
    }
}

function createStrFromAligns(aligns) {
    return aligns.map(arr => arr.map(String).join("-")).join(" ")
}

function createSentences(tokens, parent) {
    const sideStr = parent.id == "source" ? "src" : "tgt"
    for (let [index, token] of tokens.entries()) {
        let el = document.createElement("span")
        el.className = "word"
        el.textContent = token
        el.dataset.side = sideStr
        el.dataset.index = index
        parent.appendChild(el)
    }
}

function setWordAligned(word, aligned_idx) {
    aligned_idx = aligned_idx.toString()
    if ("aligned" in word.dataset) {
        let aligned_idxs = JSON.parse(word.dataset.aligned).map(String)
        aligned_idxs.push(aligned_idx)
        // Only unique items
        aligned_idxs = [...new Set(aligned_idxs)]
        word.dataset.aligned = JSON.stringify(aligned_idxs)
    } else {
        word.dataset.aligned = JSON.stringify([aligned_idx])
    }
}

function removeWordAligned(word, aligned_idx) {
    aligned_idx = aligned_idx.toString()
    aligned_idxs = JSON.parse(word.dataset.aligned).map(String)
    const idx_in_arr = aligned_idxs.indexOf(aligned_idx)

    if (idx_in_arr != -1) {
        aligned_idxs.splice(idx_in_arr, 1)
    }
    word.dataset.aligned = JSON.stringify(aligned_idxs)
}

function drawAligns(aligns) {
    clearDrawBoard();

    const drawboard = document.querySelector("#alignments > svg")
    const drawboardHeight = drawboard.getBoundingClientRect().height
    const src_words = src.querySelectorAll("span.word")
    const tgt_words = tgt.querySelectorAll("span.word")

    for (let align of aligns) {
        const src = src_words[align[0]]
        const tgt = tgt_words[align[1]]
        setWordAligned(src, align[1])
        setWordAligned(tgt, align[0])

        const srcRect = src.getBoundingClientRect();
        const tgtRect = tgt.getBoundingClientRect();
        const start = {
            "x": src.offsetLeft + (srcRect.width / 2),
            "y": 8
        }
        const end = {
            "x": tgt.offsetLeft + (tgtRect.width / 2),
            "y": drawboardHeight - 8
        }

        let line = document.createElementNS("http://www.w3.org/2000/svg", "line");
        line.setAttribute("x1", start.x)
        line.setAttribute("x2", end.x)
        line.setAttribute("y1", start.y)
        line.setAttribute("y2", end.y)
        line.dataset.src = align[0]
        line.dataset.tgt = align[1]
        drawboard.appendChild(line)
    }
}

function emptyElements(els) {
    if (!Array.isArray(els)) {
        els = [els]
    }

    for (el of els) {
        while (el.firstChild) {
            el.removeChild(el.lastChild);
        }
    }
}

function errorHandling(message) {
    if (message != "") {
        error.innerHTML = "<p>" + message + "</p>"
        app.style.display = "none";
        error.style.display = "block";
    } else {
        emptyElements(error)
        app.style.display = "block";
        error.style.display = "none";
    }
}

function getMaxWidth(...els) {
    return Math.max(...els.map(el => el.getBoundingClientRect().width))
}

function clearDrawBoard() {
    alignsEl.innerHTML = '<svg xmlns="http://www.w3.org/2000/svg" width="0" height="0"></svg>'
    const drawboard = alignsEl.querySelector("svg")
    const drawboardRect = drawboard.parentNode.getBoundingClientRect()
    drawboard.setAttribute("width", getMaxWidth(src, tgt, alignsEl));
    drawboard.setAttribute("height", drawboardRect.height)
}

function parseText() {
    const src_strings = src_inp.value.split(" ");
    const tgt_strings = tgt_inp.value.split(" ");
    emptyElements([src, tgt])
    createSentences(src_strings, src);
    createSentences(tgt_strings, tgt);

    src.querySelectorAll("span.word").forEach(el => {
        el.addEventListener("mouseover", evt => { if (!evt.target.classList.contains("alignable")) { highlight(evt.target, "src") } })
        el.addEventListener("mouseleave", evt => removeHighlights())
    })

    tgt.querySelectorAll("span.word").forEach(el => {
        el.addEventListener("mouseover", evt => { if (!evt.target.classList.contains("alignable")) { highlight(evt.target, "tgt") } })
        el.addEventListener("mouseleave", evt => removeHighlights())
    })

}

function parseAligns() {
    aligns_str = aligns_inp.value.trim()

    let aligns
    if (aligns_str) {
        aligns = createAlignsFromStr(aligns_str)
    } else {
        clearDrawBoard()
        aligns = false
    }

    if (aligns != false) {
        const n_src_tokens = src.querySelectorAll("span.word").length
        const n_tgt_tokens = tgt.querySelectorAll("span.word").length
        const src_ids = aligns.map(align => align[0])
        const tgt_ids = aligns.map(align => align[1])
        if (Math.max(...src_ids) >= n_src_tokens.length || Math.max(...tgt_ids) >= n_tgt_tokens.length) {
            errorHandling("The alignments do not match the number of source or target tokens you have given.")
        } else {
            // Clear any previous errors
            errorHandling("")
            drawAligns(aligns)
        }
    }
}

function highlight(word, side) {
    removeHighlights()
    if ("aligned" in word.dataset) {
        // Because all other `dataset` items below are str, convert indices to str
        const aligned_idxs = JSON.parse(word.dataset.aligned).map(String)
        let lines = Array.from(alignsEl.querySelectorAll("line"))
        let words
        if (side == "src") {
            words = tgt.querySelectorAll("span.word")
            // Only include lines whose source is the current word's ID
            lines = lines.filter(line => line.dataset.src == word.dataset.index)
        } else {
            words = src.querySelectorAll("span.word")
            // Only include lines whose target is the current word's ID
            lines = lines.filter(line => line.dataset.tgt == word.dataset.index)
        }
        // Only include words whose index is in the aligned idxs
        words = Array.from(words).filter(word => aligned_idxs.includes(word.dataset.index))
        const elements = [...words, ...lines, word]
        elements.forEach(el => el.classList.add("highlight"))
    }
}

function removeHighlights() {
    const elements = [...tgt.querySelectorAll("span.word"),
    ...src.querySelectorAll("span.word"),
    ...alignsEl.querySelectorAll("line")]

    elements.forEach(el => {
        if (!("clicked" in el.dataset)) {
            el.classList.remove("highlight")
        }
    })
}

form.addEventListener("submit", evt => {
    evt.preventDefault();
    parseText();
    parseAligns();
})

window.addEventListener("resize", evt => {
    parseText();
    parseAligns();
});

app.addEventListener("mouseleave", evt => {
    removeHighlights()
});

// Trigger submit for the first load
form.querySelector("input[type=submit]").click()

/* ALIGNER */
let sourceClicked = false
let targetClicked = false

function addOrRemoveAlignable(word1, word2) {
    let new_align
    if (word1.dataset.side == "src") {
        new_align = [word1.dataset.index, word2.dataset.index].join("-")
    } else {
        new_align = [word2.dataset.index, word1.dataset.index].join("-")
    }

    let align_pairs = aligns_inp.value.trim()

    if (align_pairs) {
        align_pairs = align_pairs.split(" ")
    } else {
        align_pairs = []
    }

    if (align_pairs.includes(new_align)) {
        // Remove alignment
        removeWordAligned(word1, word2.dataset.index)
        removeWordAligned(word2, word1.dataset.index)
        align_pairs.splice(align_pairs.indexOf(new_align), 1)
    } else {
        // Add alignment
        setWordAligned(word1, word2.dataset.index)
        setWordAligned(word2, word1.dataset.index)
        align_pairs.push(new_align)
    }

    if (align_pairs.length == 0) {
        aligns_inp.value = ""
    } else {
        // Not the most efficient way to sort the alignments, but hey...
        // So before we work with strings, but we want to sort the alignments,
        // so we convert the string to integer alignments, then sort them,
        // and then convert them back
        align_pairs = createAlignsFromStr(align_pairs.join(" "))
        aligns_inp.value = createStrFromAligns(align_pairs.sort())
    }

    parseAligns();
}

function align(side, evt) {
    if (evt.target.tagName == "SPAN") {
        const otherClicked = side == "src" ? targetClicked : sourceClicked
        const otherParent = side == "src" ? tgt : src
        const thisParent = side == "src" ? src : tgt

        if (otherClicked) {
            const otherClickedEl = otherParent.querySelector("span.word[data-clicked='true']")
            addOrRemoveAlignable(evt.target, otherClickedEl)

            thisParent.querySelectorAll("span.word").forEach(el => el.classList.remove("alignable", "removable"))
            delete otherClickedEl.dataset.clicked
            if (side == "src") {
                targetClicked = false
            } else {
                sourceClicked = false
            }
        } else {
            const prevThisClicked = thisParent.querySelector("span.word[data-clicked='true']")
            if (prevThisClicked) {
                delete prevThisClicked.dataset.clicked
                otherParent.querySelectorAll("span.word").forEach(el => el.classList.remove("alignable", "removable"))
            }

            evt.target.dataset.clicked = true
            highlight(evt.target, side)

            otherParent.querySelectorAll("span.word").forEach(el => el.classList.add("alignable"))
            if ("aligned" in evt.target.dataset) {
                const aligned_idxs = JSON.parse(evt.target.dataset.aligned).map(String)
                Array.from(otherParent.querySelectorAll("span.word")).filter(el => aligned_idxs.includes(el.dataset.index)).forEach(el => el.classList.add("removable"))
            }

            if (side == "src") {
                sourceClicked = true
            } else {
                targetClicked = true
            }
        }
    }
}

// To stop the alignment process when an element has already been clicked
window.addEventListener("click", evt => {
    if (evt.target.tagName != "SPAN" && !evt.target.classList.contains("word")) {
        const clickedEls = app.querySelectorAll("span.word[data-clicked='true']")

        Array.from(clickedEls).forEach(el => delete el.dataset.clicked)

        app.querySelectorAll("span.word").forEach(el => el.classList.remove("alignable", "removable"))

        targetClicked = false
        sourceClicked = false
        removeHighlights()
    }
})

src.addEventListener("click", align.bind(this, "src"))
tgt.addEventListener("click", align.bind(this, "tgt"))
